{
    "courses_online": {
        "status": 200,
        "message": "PASS",
        "Course": [
            {
                "courseID": "COURSE_224",
                "courseTitle": "Data Science Fundamentals with Python and SQL Specialization 1",
                "Tech_Skill": "Python, R, SQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R, GitHub, NumPy, SQL, IBM Watson Studio, API, Jupyter, R Studio, Python, Pandas, Ipython, Probability, Statistics, Data Visualization, Statistical Hypothesis Testing, Cloud Databases",
                "outcomeLearning": "Working knowledge of Data Science Tools such as Jupyter Notebooks, R Studio, GitHub, Watson Studio. Python programming basics including data structures, logic, working with files, invoking APIs, and libraries such as Pandas and Numpy. Statistical Analysis techniques including Descriptive Statistics, Data Visualization, Probability Distribution, Hypothesis Testing and Regression. Relational Database fundamentals including SQL query language, Select statements, sorting & filtering, database functions, accessing multiple tables",
                "provider": "Udemy",
                "duration": "18:00:00",
                "feeVND": "21089000.0",
                "URL": "https://www.coursera.org/specializations/data-science-fundamentals-python-sql",
                "language": "Arabic, French, Portuguese, Italian, German, Russian, Spanish, Vietnamese, English",
                "rating": "4.6",
                "peopleRating": "583",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_180",
                "courseTitle": "Data Science Fundamentals with Python and SQL Specialization",
                "Tech_Skill": "Python, R, SQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R, GitHub, NumPy, SQL, IBM Watson Studio, API, Jupyter, R Studio, Python, Pandas, Ipython, Probability, Statistics, Data Visualization, Statistical Hypothesis Testing, Cloud Databases",
                "outcomeLearning": "Working knowledge of Data Science Tools such as Jupyter Notebooks, R Studio, GitHub, Watson Studio. Python programming basics including data structures, logic, working with files, invoking APIs, and libraries such as Pandas and Numpy. Statistical Analysis techniques including Descriptive Statistics, Data Visualization, Probability Distribution, Hypothesis Testing and Regression. Relational Database fundamentals including SQL query language, Select statements, sorting & filtering, database functions, accessing multiple tables",
                "provider": "Coursera",
                "duration": "2 months",
                "feeVND": "21089000.0",
                "URL": "https://www.coursera.org/specializations/data-science-fundamentals-python-sql",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.6",
                "peopleRating": "583",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_179",
                "courseTitle": "Introduction to Data Science Specialization",
                "Tech_Skill": "Python, R, SQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R, Jupyter, SQL, GitHub, IBM Watson Studio, R Studio, Python, RDBMS, Cloud Databases, Ipython",
                "outcomeLearning": "Describe what data science and machine learning are, their applications & use cases, and various types of tasks performed by data scientists. Gain hands-on familiarity with common data science tools including JupyterLab, R Studio, GitHub and Watson Studio. Develop the mindset to work like a data scientist, and follow a methodology to tackle different types of data science problems. Write SQL statements and query Cloud databases using Python from Jupyter notebooks",
                "provider": "Coursera",
                "duration": "12:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/introduction-data-science",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.7",
                "peopleRating": "9228",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_032",
                "courseTitle": "Back-End Engineer1",
                "Tech_Skill": "SQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Kubernetes, PostgreSQL, JavaScript, Scrum, OOP, SQL, Oauth, Node.js, HTTP, Express.js, GitHub, Git, Agile, YAGNI, Docker, KISS, Azure DevOps, API, TDD, Design Patterns, RDBMS, DRY, SOLID, Linear Data Structures, Complex Data Structures, Search Algorithm",
                "outcomeLearning": "Setting Up Your Dev Environment. Learn about the field of web development and the tools developers use to create websites. JavaScript Syntax, Part I. Get introduced to JavaScript and get comfortable with the basics of writing JavaScript programs. JavaScript Syntax, Part II. Discover more JavaScript techniques and features including arrays, looping, and objects. Git and Github, Part I. Learn how to use the Git version control system to keep track of changes and document your work. Then learn markdown and publish your first. JavaScript Syntax Portfolio Project. Build a Node.js console app that generates random messages each time a user runs the program and version your project with Git/GitHub. Basics of Back-End Development. Start learning about back-end development and programming servers. JavaScript Syntax, Part III. Understand intermediate JavaScript concepts, such as classes, modules, and error handling. Fundamentals of Operating Systems. Learn about how Operating Systems work. Build a Back-End with Node/Express.js. Learn about the popular back-end environment, Node.js and how to create back-end servers and APIs in JavaScript using the popular Express.js. Test Driven Development with JavaScript. Understand the fundamentals of Test Driven Development (TDD) and how you can apply its principles when developing back-ends. Website Development Fundamentals. Be introduced to the field of front-end web development and create your first web page on the internet. Building Interactive Websites with JavaScript. Understand how JavaScript is used to add interactive experiences to a website. Async JavaScript and HTTP Requests. Learn about APIs (Application Programming Interfaces). Working with APIs will enable you to work with data stored on remote servers. Git and GitHub, Part II. Learn how to use Git and GitHub to collaborate efficiently with developers. Node/Express API Portfolio Project. You can use Node and Express to build an API that allows users to create and manage a personal budget. SQL for Back-End Development. Learn how to create tables, create, retrieve, and update data in SQL databases, and build a data-intensive web app. PostgreSQL Database. Much of the internet is the flow of information. Learn how databases store data so that it can be displayed on the web using PostgreSQL. Designing Relational Databases. Learn how to design relational databases that you can then implement in PostgreSQL advanced PostgreSQL. Learn about database performance and techniques for efficiently accessing data and maintaining optimal performance. Connecting Your Database to a Server\nLearn how to integrate a PostgreSQL database into your application. Deploying Your Server. Learn how to build an API with Node, Express, PostgreSQL and deploy it to Heroku. YAGNI, KISS, and DRY. Learn about different software principles. Object-Oriented Design & SOLID. Learn about object-oriented programming (OOP) and the principles of encapsulation, abstraction, inheritance, polymorphism as well as SOLID. Common Design Patterns. The goal of this unit is to introduce the concept of software design patterns. Software Architectural Patterns. Learn about the concept of architectural patterns as well as learn about specific patterns currently used by the development community. Relational Database and Software Architecture Portfolio Project\nTake your budget app one step further and add a new layer to the project by setting up a database. Security Basics. The goal of this unit is to introduce the basic concepts of web security including common threats, best practices and available technologies. Web Security. Learn intermediate concepts in web security and look at prevention techniques for common threats. Securing Your Server. Identify techniques you can use to secure your applications. Protecting Resources with OAuth. Learn how to protect your resources with authorization and authentication techniques. Database Security. Secure your databases from SQL injections and with security measures specifically for PostgreSQL. Introduction to Enterprise Development. Get an overview of the technologies involved in enterprise development. Caching & CDNs. Learn about how content is stored on different servers with caching and CDNs. Scaling Your Server. Learn different strategies for scaling your server. Alternative Technology Approaches. Get an introduction to several technologies that can expand your understanding of back-end architecture. Agile Methodologies. Learn about Agile methodologies and Scrum. Intro to DevOps Strategies. Learn about Continuous Integration and Continuous Delivery and how to implement them with GitHub Actions. Containerization with Docker. Learn about containerization technology and how to use services like Docker and Kubernetes. Security and Enterprise Portfolio Project. Build an API with Node, Express, and Postgres that uses authentication and authorization best practices to manage an online contest. Linear Data Structures. Begin interview preparation by learning the fundamentals of linear data structures. Complex Data Structures. Continue interview preparation by learning advanced applications of data structures.Algorithms. Continue interview preparation by learning the fundamentals of algorithms. Search & Graph Search Algorithms. Continue interview preparation by learning the fundamentals of search algorithms. Interview Skills. Review some key technical interview topics as well as soft skills which employers are looking for in potential candidates. Final Back-End Portfolio Project. Use everything you've learned in the path to build an API of your choosing.",
                "provider": "Codecademy",
                "duration": "2 months",
                "feeVND": "0.0",
                "URL": "https://www.codecademy.com/learn/paths/back-end-engineer-career-path",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_177",
                "courseTitle": "IBM Data Analyst Professional Certificate",
                "Tech_Skill": "Python, SQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Microsoft Excel, Matplotlib, NumPy, SQL, Cognos, Amazon Web Services (AWS), Python, API, Pandas, Jupyter, Data Visualization, Pivot Table, Dashboard, Pandas, APIs",
                "outcomeLearning": "Demonstrate proficiency in using spreadsheets and utilizing Excel to perform a variety of data analysis tasks like data wrangling and data mining. Create various charts and plots in Excel & work with IBM Cognos Analytics to build dashboards. Visualize data using Python libraries like Matplotlib. Develop working knowledge of Python language for analyzing data using Python libraries like Pandas and Numpy, and invoke APIs and Web Services. Describe data ecosystem and Compose queries to access data in cloud databases using SQL and Python from Jupyter Notebooks",
                "provider": "Coursera",
                "duration": "09:00:00",
                "feeVND": "414166.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.7",
                "peopleRating": "4832",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_223",
                "courseTitle": "IBM Data Analyst Professional Certificate 1",
                "Tech_Skill": "Python, SQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Microsoft Excel, Matplotlib, NumPy, SQL, Cognos, Amazon Web Services (AWS), Python, API, Pandas, Jupyter, Data Visualization, Pivot Table, Dashboard, Pandas, APIs",
                "outcomeLearning": "Demonstrate proficiency in using spreadsheets and utilizing Excel to perform a variety of data analysis tasks like data wrangling and data mining. Create various charts and plots in Excel & work with IBM Cognos Analytics to build dashboards. Visualize data using Python libraries like Matplotlib. Develop working knowledge of Python language for analyzing data using Python libraries like Pandas and Numpy, and invoke APIs and Web Services. Describe data ecosystem and Compose queries to access data in cloud databases using SQL and Python from Jupyter Notebooks",
                "provider": "Udemy",
                "duration": "09:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.7",
                "peopleRating": "4832",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_220",
                "courseTitle": "Data Engineering Foundations Specialization",
                "Tech_Skill": "Python, SQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "MySQL, ETL, NumPy, SQL, PostgreSQL, IBM Db2, API, Python, Pandas, RDBMS, DBMS, NoSQL, NumPy, Web Scraping",
                "outcomeLearning": "Working knowledge of Data Engineering Ecosystem and Lifecycle. Viewpoints and tips from Data professionals on starting a career in this domain. Relational Database fundamentals including Database Design, Creating Schemas, Tables, Constraints, and working with MySQL, PostgreSQL & IBM Db2. Python programming basics including data structures, logic, working with files, invoking APIs, using libraries such as Pandas and Numpy, doing ETL. SQL query language, SELECT, INSERT, UPDATE, DELETE statements, database functions, stored procs, working with multiple tables, JOINs, & transactions.",
                "provider": "Coursera",
                "duration": "18:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/data-engineering-foundations",
                "language": "English",
                "rating": "4.7",
                "peopleRating": "380",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_181",
                "courseTitle": "IBM Data Analytics with Excel and R Professional Certificate",
                "Tech_Skill": "R, SQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R, R Studio, Jupyter, RDBMS, SQL, Microsoft Excel, Pivot Table, Data Visualization, Cognos, Spreadsheet, R Shiny",
                "outcomeLearning": "Manipulate numeric and textual data types using the R programming language and RStudio or Jupyter Notebooks. Define and manipulate R data structures, including vectors, factors, lists, and data frames. Control program flow, define functions, perform character string and date operations, define regular expressions, and handle errors. Read, write, and save data files and scrape web pages using R.",
                "provider": "Coursera",
                "duration": "22:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst-r-excel",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.8",
                "peopleRating": "270",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_187",
                "courseTitle": "Learn SQL Basics for Data Science Specialization",
                "Tech_Skill": "Apache Spark, SQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "SQL, Azure Databricks, Apache Spark, Delta Lake, SQLite, A/B Testing, Query String, Predictive Analytics, Creating Metrics, EDA",
                "outcomeLearning": "Use SQL commands to filter, sort, & summarize data; manipulate strings, dates, & numerical data from different sources for analysis. A​ssess and create datasets to solve your business questions and problems using SQL. U​se the collaborative Databricks workspace and create an end-to-end pipeline that reads data, transforms it, and saves the result. ​Develop a project proposal & select your data, perform statistical analysis & develop metrics, and p​resent your findings & make recommendations.",
                "provider": "Coursera",
                "duration": "20:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/learn-sql-basics-data-science",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish, Chinese",
                "rating": "4.5",
                "peopleRating": "4969",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_183",
                "courseTitle": "IBM Full Stack Cloud Developer Professional Certificate",
                "Tech_Skill": "Python",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Bootstrap, Kubernetes, Django, Cloud Native, React, JavaScript, GitHub, CSS, Microservices, HTML, Node.js, Python, Containers, Openshift, Cloud Computing, Azure DevOps, IaaS, PAAS, SAAS, Hybrid Multicloud",
                "outcomeLearning": "Develop with front-end development languages and tools such as HTML, CSS, JavaScript, React and Bootstrap. Program applications using back-end languages and frameworks like Express, Node.js, Python, Django, etc. Deploy and scale applications using Cloud Native methodologies and tools like Containers, Kubernetes, Microservices and Serverless Functions. Build your GitHub portfolio by applying your Full Stack Cloud Development skills with multiple labs and hands-on projects, including a capstone",
                "provider": "Coursera",
                "duration": "22:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-full-stack-cloud-developer",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.6",
                "peopleRating": "355",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            }
        ],
        "Exception": [
            {
                "lstSkill_Provider": "Python, R, SQL, Apache Spark",
                "lstSkill_notProvider": "Apache Hadoop, XML"
            }
        ],
        "Ngoai_Le": {
            "Course_Offer": [],
            "ExceptionDetail": []
        }
    },
    "courses_offline": {
        "status": 400,
        "message": "no courses",
        "Course": [],
        "Exception": [
            {
                "job_offer": "Senior SQL Server Developer, Mobile Tester, Data Manager, Senior C# Developer, Senior Business Analyst"
            }
        ],
        "Ngoai_Le": {
            "Course_Offer": [],
            "ExceptionDetail": []
        }
    }
}