{
    "skills_acquired": "Microsoft Office, Microsoft Excel, Microsoft PowerPoint, SQL, Microsoft Word, Financial, IBM Db2, RPG, SAP ECC, XML, Microsoft Power BI, Microsoft Outlook, Sisense, Tableau, Microsoft Dynamics CRM 365, Microsoft Dynamics GP, Apache Airflow, Azure Databricks, ETL, GitHub, Pycharm, Redshift, Amazon S3, Data Lake, Microsoft Oracle, Risk Management, SAAS, Microsoft Visio, Workforce Management (WFM), Software Architect (SA), Amazon Web Services (AWS), Microsoft Azure, CI/CD, Chef, DNS, Datadog, Docker, Elastic Search, GitLab, Google Cloud, Jenkins, Kubernetes, Linux, Puppet, Python, Splunk, TCP/IP, VLAN, Bash",
    "skills_to_learn": "Microsoft Office, Microsoft Excel, Microsoft PowerPoint, Microsoft Word, Financial, IBM Db2, RPG, SAP ECC, XML, Microsoft Power BI, Microsoft Outlook, Sisense, Tableau, Microsoft Dynamics CRM 365, Microsoft Dynamics GP, Apache Airflow, Azure Databricks, ETL, GitHub, Pycharm, Redshift, Amazon S3, Data Lake, Risk Management, SAAS, Microsoft Visio, Workforce Management (WFM), Software Architect (SA), Amazon Web Services (AWS), Microsoft Azure, CI/CD, Chef, DNS, Datadog, Docker, Elastic Search, GitLab, Google Cloud, Jenkins, Kubernetes, Linux, Puppet, Python, Splunk, TCP/IP, VLAN, Bash",
    "courses_online": {
        "status": 200,
        "message": "PASS",
        "Course": [
            {
                "courseID": "COURSE_397",
                "courseTitle": "IBM Full Stack Cloud Developer Professional Certificate",
                "Tech_Skill": "GitHub, Kubernetes, Python, SAAS",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Bootstrap, Kubernetes, Django, Cloud Native, React, JavaScript, GitHub, CSS, Microservices, HTML, Node.js, Python, Openshift, Cloud Computing, Azure DevOps, IaaS, PAAS, SAAS",
                "outcomeLearning": "Develop with front-end development languages and tools such as HTML, CSS, JavaScript, React and Bootstrap. Program applications using back-end languages and frameworks like Express, Node.js, Python, Django, etc. Deploy and scale applications using Cloud Native methodologies and tools like Containers, Kubernetes, Microservices and Serverless Functions. Build your GitHub portfolio by applying your Full Stack Cloud Development skills with multiple labs and hands-on projects, including a capstone",
                "provider": "Coursera",
                "duration": "22:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-full-stack-cloud-developer",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.6",
                "peopleRating": "355",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_391",
                "courseTitle": "IBM Data Analyst Professional Certificate",
                "Tech_Skill": "Amazon Web Services (AWS)Microsoft Excel",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Microsoft Excel, Matplotlib, NumPy, SQL, Cognos, Amazon Web Services (AWS), Python, API, Pandas, Jupyter, Pivot, Dashboard, Pandas, APIs",
                "outcomeLearning": "Demonstrate proficiency in using spreadsheets and utilizing Excel to perform a variety of data analysis tasks like data wrangling and data mining. Create various charts and plots in Excel & work with IBM Cognos Analytics to build dashboards. Visualize data using Python libraries like Matplotlib. Develop working knowledge of Python language for analyzing data using Python libraries like Pandas and Numpy, and invoke APIs and Web Services. Describe data ecosystem and Compose queries to access data in cloud databases using SQL and Python from Jupyter Notebooks",
                "provider": "Coursera",
                "duration": "9:00:00",
                "feeVND": "414166.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.7",
                "peopleRating": "4832",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_434",
                "courseTitle": "Data Engineering Foundations Specialization",
                "Tech_Skill": "ETLIBM Db2",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "MySQL, ETL, NumPy, SQL, PostgreSQL, IBM Db2, API, Python, Pandas, RDBMS, DBMS, NoSQL, NumPy, Web Scraping",
                "outcomeLearning": "Working knowledge of Data Engineering Ecosystem and Lifecycle. Viewpoints and tips from Data professionals on starting a career in this domain. Relational Database fundamentals including Database Design, Creating Schemas, Tables, Constraints, and working with MySQL, PostgreSQL & IBM Db2. Python programming basics including data structures, logic, working with files, invoking APIs, using libraries such as Pandas and Numpy, doing ETL. SQL query language, SELECT, INSERT, UPDATE, DELETE statements, database functions, stored procs, working with multiple tables, JOINs, & transactions.",
                "provider": "Coursera",
                "duration": "18:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/data-engineering-foundations",
                "language": "English",
                "rating": "4.7",
                "peopleRating": "380",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_359",
                "courseTitle": "Spring Professional Certification Practice Tests Module 07",
                "Tech_Skill": "CI/CDJenkins",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "RAS, STF, Jenkins, OpenSTF, AWS Device Farm, Selenium GRID, Appium, Python, API, RESTful API, APIs, CI/CD",
                "outcomeLearning": "With this set of practice tests you will review:\nREST API basics, REST API Achitectural Constraints, REST API Endpoints with Spring, REST API Client with Spring, REST API Controller Annotations, CRUD with REST API, role of HttpMessageConverter ...and much more\nIf you already have some knowledge on Spring REST, you can use this set of tests to measure your current knowledge.",
                "provider": "Udemy",
                "duration": "05:25:00",
                "feeVND": "322078.0",
                "URL": "https://www.udemy.com/course/spring-professional-certification-practice-tests-module-07/",
                "language": "English",
                "rating": "5.0",
                "peopleRating": "8",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_410",
                "courseTitle": "Excel to MySQL: Analytic Techniques for Business Specialization",
                "Tech_Skill": "Microsoft Excel, Tableau",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "MySQL, Tableau, Microsoft Excel, SQL",
                "outcomeLearning": "In this Specialization, you'll learn to frame business challenges as data questions. You'll use powerful tools and methods such as Excel, Tableau, and MySQL to analyze data, create forecasts and models, design visualizations, and communicate your insights. In the final Capstone Project, you'll apply your skills to explore and justify improvements to a real-world business process. The Capstone Project focuses on optimizing revenues from residential property, and Airbnb, our Capstone's official Sponsor, provided input on the project design. Airbnb is the world's largest marketplace connecting property-owner hosts with travelers to facilitate short-term rental transactions. The top 10 Capstone completers each year will have the opportunity to present their work directly to senior data scientists at Airbnb live for feedback and discussion.",
                "provider": "Coursera",
                "duration": "4:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/excel-mysql",
                "language": "English, Arabic, French, Portuguese, Chinese, Italian, Vietnamese, Korean, German, Russian, Spanish",
                "rating": "4.6",
                "peopleRating": "10557",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_358",
                "courseTitle": "Introduction to Google Colaboratory with Python",
                "Tech_Skill": "DNS, Linux",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Tmux, Git, CSysdig, iproute2, DNS, SSH, Windows, SOCKS, IPTables, Linux",
                "outcomeLearning": "Google Colaboratory is a Google cloud-based service that replicates Jupyter Notebook in the cloud. You don't have to install anything on your system to use it. In most respects, you use Colaboratory as you would a desktop installation of Jupyter Notebook. Google Colaboratory is primarily for those readers who use something other than a standard desktop setup to work.\nYou'll learn about the all features of Google Colaboratory.\nThe course is for you if you're a newcomer to Data Science and Python programming. Google recently update their Google Colabortatory in January 2020. This course is totally on the new version of Google Colaboratory",
                "provider": "Udemy",
                "duration": "09:01:00",
                "feeVND": "322078.0",
                "URL": "https://www.udemy.com/course/introduction-to-google-colaboratory-with-python/",
                "language": "English",
                "rating": "4.4",
                "peopleRating": "544",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_406",
                "courseTitle": "AWS Fundamentals Specialization",
                "Tech_Skill": "Amazon Web Services (AWS), Google Cloud",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "REST, Amazon Web Services (AWS), Amazon GuardDuty, Amazon CloudTrail, AWS Security Hub, Google Cloud, AWS Lambda, Amazon Lex",
                "outcomeLearning": "You will be able to make an informed decision about when and how to apply key AWS services for compute, storage, and database to different use cases. Foundational security concepts, including basic concepts such as \"least privilege\" and the \"Shared Responsibility Model\". Detective controls, including Amazon CloudTrail, AWS Security Hub, Amazon GuardDuty, and AWS Config. Encryption of data at rest, in motion, and best practices for how to store data within and between various AWS services.",
                "provider": "Coursera",
                "duration": "12:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/aws-fundamentals",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish, Korean",
                "rating": "4.6",
                "peopleRating": "9516",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_395",
                "courseTitle": "IBM Data Analytics with Excel and R Professional Certificate",
                "Tech_Skill": "Microsoft Excel",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R, R Studio, Jupyter, RDBMS, SQL, Microsoft Excel, Pivot, Cognos, Spreadsheet, R Shiny",
                "outcomeLearning": "Manipulate numeric and textual data types using the R programming language and RStudio or Jupyter Notebooks. Define and manipulate R data structures, including vectors, factors, lists, and data frames. Control program flow, define functions, perform character string and date operations, define regular expressions, and handle errors. Read, write, and save data files and scrape web pages using R.",
                "provider": "Coursera",
                "duration": "22:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst-r-excel",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.8",
                "peopleRating": "270",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_403",
                "courseTitle": "Cloud Application Development Foundations Specialization",
                "Tech_Skill": "CI/CD",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Node.js, Cloud Native, React, GitHub, CSS, NoSQL, HTML, JavaScript, SQL, CI/CD, Azure DevOps, Cloud Computing, IaaS, PAAS, SAAS",
                "outcomeLearning": "Define cloud computing and explain its essential characteristics, models, benefits, infrastructure, & emerging trends. Create a cloud account. Develop with front-end development languages and tools such as HTML, CSS, Javascript and React. Program applications with back-end development languages and tools such as Node.js  and NoSQL databases. Build and deploy applications using Cloud Native methodologies and tools, CI/CD toolchains, and build your portfolio using GitHub",
                "provider": "Coursera",
                "duration": "12:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/ibm-cloud-application-development-foundations",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.6",
                "peopleRating": "108",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_401",
                "courseTitle": "Learn SQL Basics for Data Science Specialization",
                "Tech_Skill": "Azure Databricks",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "SQL, Azure Databricks, Apache Spark, Delta Lake, SQLite, A/B Testing, Predictive Analytics, EDA",
                "outcomeLearning": "Use SQL commands to filter, sort, & summarize data; manipulate strings, dates, & numerical data from different sources for analysis. A​ssess and create datasets to solve your business questions and problems using SQL. U​se the collaborative Databricks workspace and create an end-to-end pipeline that reads data, transforms it, and saves the result. ​Develop a project proposal & select your data, perform statistical analysis & develop metrics, and p​resent your findings & make recommendations.",
                "provider": "Coursera",
                "duration": "20:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/learn-sql-basics-data-science",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish, Chinese",
                "rating": "4.5",
                "peopleRating": "4969",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_424",
                "courseTitle": "Introduction to TCP/IP",
                "Tech_Skill": "TCP/IP",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "IPv4, TCP, IPv6, Wireshark, UDP, TCP/IP, Network Protocols",
                "outcomeLearning": "You use the Internet through your PC (Personal Computer), laptop, tablet, smartpad, and smartphone every day in everything you do. Through your own PC/laptop, you can easily learn everything about the Internet, and that is what this course is focused on. In this course 'Introduction to TCP/IP,' you will learn the operational functions of Internet technologies (which include IPv4, IPv6, TCP, UDP, addressing, routing, domain names, etc.) and your PC/laptop's security and gateway Internet setup and basic principles. In addition, through a simple Wireshark experiment, you will see the TCP/IP packets and security systems in action that are serving your PC/laptop, that serves you.",
                "provider": "Coursera",
                "duration": "8:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/learn/tcpip",
                "language": "Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, English, Spanish",
                "rating": "4.6",
                "peopleRating": "1647",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_284",
                "courseTitle": "Build Basic Android Apps with Java",
                "Tech_Skill": "XML",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Android, Android Studio, Java, XML, Wireframe",
                "outcomeLearning": "Android and Java foundations. Wireframe your first app, learn about variables in Java, and dig into the Android Studio IDE. Learn about programming logic in Java and continue to build the Unquote trivia game. Learn about arrays and Loops in Java and continue to build out the Unquote game. Android App Development. Really dig into Android development fundamentals by working with Android Layouts and Views and handling user interactions. intermediate Java and Capstone Project. Pick up more Java programming skills and complete your Unquote application",
                "provider": "Codecademy",
                "duration": "10:00:00",
                "feeVND": "0.0",
                "URL": "https://www.codecademy.com/learn/paths/introduction-to-android-with-java",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_315",
                "courseTitle": "Docker Mastery: with Kubernetes +Swarm from a Docker Captain",
                "Tech_Skill": "Docker",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Kubernetes, Docker Swarm, Virtual IPS, Node.js, YAML, Docker",
                "outcomeLearning": "How to use Docker, Compose and Kubernetes on your machine for better software building and testing. Learn faster with included live chat group (21,000 members!) and weekly live Q&A. Build Swarm and Kubernetes clusters for server deployments. Build and publish your own custom images. Learn Docker and Kubernetes official tools from an award-winning Docker Captain. Gain the skills to build development environments with your code running in containers. Hand's-on with best practices for making Dockerfiles and Compose files like a Pro. Create your own custom image registry to store your apps and deploy in corporate environments.",
                "provider": "Udemy",
                "duration": "19:39:00",
                "feeVND": "322078.0",
                "URL": "https://bit.ly/2Q8fQwJ",
                "language": "English, French, German, Indonesian, Italian, Polish, Portuguese, Spanish",
                "rating": "4.6",
                "peopleRating": "47700",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_407",
                "courseTitle": "Python 3 Programming Specialization",
                "Tech_Skill": "Python",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Python, API, Python, OpenCV, APIs, Json",
                "outcomeLearning": "How to inspect and understand APIs and third party libraries to be used with Python 3. How to apply the Python imaging library (pillow) to open, view, and manipulate images, including cropping, resizing, recoloring, and overlaying text. How to apply the python tesseract (py-tesseract) library with Python 3 in order to detect text in images through optical character recognition (OCR). How to apply the open source computer vision library (opencv) to detect faces in images, & how to crop and manipulate these faces into contact sheets.",
                "provider": "Coursera",
                "duration": "11:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/python-3-programming",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, Korean, German, Russian, Spanish",
                "rating": "4.7",
                "peopleRating": "13455",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_431",
                "courseTitle": "Introduction to Data Analytics",
                "Tech_Skill": "Microsoft Azure",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Jupyter, Microsoft Azure, Machine Learning, Scikit-learn, Python, API, Microsoft Azure",
                "outcomeLearning": "This course presents a gentle introduction into the concepts of data analysis, the role of a Data Analyst, and the tools that are used to perform daily functions. You will gain an understanding of the data ecosystem and the fundamentals of data analysis, such as data gathering or data mining. You will then learn the soft skills that are required to effectively communicate your data to stakeholders, and how mastering these skills can give you the option to become a data driven decision maker. This course will help you to differentiate between the roles of a Data Analyst, Data Scientist, and Data Engineer. You will learn the responsibilities of a Data Analyst and exactly what data analysis entails. You will be able to summarize the data ecosystem, such as databases and data warehouses. You will then uncover the major vendors within the data ecosystem and explore the various tools on-premise and in the cloud. Continue this exciting journey and discover Big Data platforms such as Hadoop, Hive, and Spark. By the end of this course you will be able to visualize the daily life of a Data Analyst, understand the different career paths that are available for data analytics, and identify the many resources available for mastering this profession. Throughout this course you will learn the key aspects to data analysis. You will begin to explore the fundamentals of gathering data, and learning how to identify your data sources. You will then learn how to clean, analyze, and share your data with the use of visualizations and dashboard tools. This all comes together in the final project where it will test your knowledge of the course material, explore what it means to be a Data Analyst, and provide a real-world scenario of data analysis. This course does not require any prior data analysis, spreadsheet, or computer science experience. All you need to get started is basic computer literacy, high school level math, and access to a modern web browser such as Chrome or Firefox.",
                "provider": "Coursera",
                "duration": "11:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/learn/introduction-to-data-analytics",
                "language": "Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, English, Spanish",
                "rating": "4.8",
                "peopleRating": "3632",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_345",
                "courseTitle": "Docker for the Absolute Beginner - Hands On - DevOps",
                "Tech_Skill": "Docker",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Docker, Dockerfile, Azure DevOps, Docker Compose, Docker Swarm",
                "outcomeLearning": "Docker is an open platform for developers and sysadmins to build, ship, and run distributed applications, whether on laptops, data center VMs, or the cloud. This course introduces Docker to an Absolute Beginner using really simple and easy to understand lectures. Lectures are followed by demos showing how to setup and get started with Docker. The coding exercises that accompany this course will help you practice Docker commands and developing your own images using Dockerfiles and practice Docker Compose. You will be developing Docker files for different use cases right in your browser. This way you don't really need to have your own environment setup to get some hands on practice. The coding exercises will validate your commands and Dockerfiles and ensure you have written them correctly. And finally we have assignments to put your skills to test. You will be given a challenge to solve using the skills you gained during this course. This is a great way to gain a real life project experience and work with the other students in the community to develop a Dockerfile and get feedback for your work. The assignment will push you to research and develop your own Docker images. This course is designed for beginners in DevOps",
                "provider": "Udemy",
                "duration": "4:17:00",
                "feeVND": "322078.0",
                "URL": "https://www.udemy.com/course/learn-docker/",
                "language": "English, French, German, Indonesian, Italian, Polish, Portuguese, Spanish",
                "rating": "4.6",
                "peopleRating": "23875",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_347",
                "courseTitle": "Docker for the Absolute Beginner - Hands On - DevOps",
                "Tech_Skill": "Docker",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Docker, Dockerfile, Azure DevOps, Docker Compose, Docker Swarm",
                "outcomeLearning": "Docker is an open platform for developers and sysadmins to build, ship, and run distributed applications, whether on laptops, data center VMs, or the cloud. This course introduces Docker to an Absolute Beginner using really simple and easy to understand lectures. Lectures are followed by demos showing how to setup and get started with Docker. The coding exercises that accompany this course will help you practice Docker commands and developing your own images using Dockerfiles and practice Docker Compose. You will be developing Docker files for different use cases right in your browser. This way you don't really need to have your own environment setup to get some hands on practice. The coding exercises will validate your commands and Dockerfiles and ensure you have written them correctly. And finally we have assignments to put your skills to test. You will be given a challenge to solve using the skills you gained during this course. This is a great way to gain a real life project experience and work with the other students in the community to develop a Dockerfile and get feedback for your work. The assignment will push you to research and develop your own Docker images. This course is designed for beginners in DevOps",
                "provider": "Udemy",
                "duration": "4:17:00",
                "feeVND": "322078.0",
                "URL": "https://www.udemy.com/course/learn-docker/",
                "language": "English, French, German, Indonesian, Italian, Polish, Portuguese, Spanish",
                "rating": "4.6",
                "peopleRating": "23875",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_367",
                "courseTitle": "Introduction to Tableau",
                "Tech_Skill": "Python",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Logistic Regression, Machine Learning, SVM, Scikit-learn, Python",
                "outcomeLearning": "Tableau is a widely used business intelligence (BI) and analytics software trusted by companies like Amazon, Experian, and Unilever to explore, visualize, and securely share data in the form of Workbooks and Dashboards. With its user-friendly drag-and-drop functionality it can be used by everyone to quickly clean, analyze, and visualize your team's data. You'll learn how to navigate Tableau's interface and connect and present data using easy-to-understand visualizations. By the end of this training, you'll have the skills you need to confidently explore Tableau and build impactful data dashboards. Let's dive in.",
                "provider": "Datacamp",
                "duration": "6:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/introduction-to-tableau",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_366",
                "courseTitle": "Linear Classifiers in Python",
                "Tech_Skill": "Python",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Logistic Regression, Machine Learning, SVM, Scikit-learn, Python",
                "outcomeLearning": "In this course you'll learn all about using linear classifiers, specifically Logistic Regression and Support Vector Machines, with scikit-learn. Once you've learned how to apply these methods, you'll dive into the ideas behind them and find out what really makes them tick. At the end of this course you'll know how to train, test, and tune these linear classifiers in Python. You'll also have a conceptual foundation for understanding many other Machine Learning algorithms.",
                "provider": "Datacamp",
                "duration": "4:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/linear-classifiers-in-python",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_423",
                "courseTitle": "Machine Learning Pipelines with Azure ML Studio",
                "Tech_Skill": "Microsoft Azure",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Jupyter, Microsoft Azure, Machine Learning, Scikit-learn, Python, API, Microsoft Azure",
                "outcomeLearning": "In this project-based course, you are going to build an end-to-end machine learning pipeline in Azure ML Studio, all without writing a single line of code! This course uses the Adult Income Census data set to train a model to predict an individual's income. It predicts whether an individual's annual income is greater than or less than $50,000. The estimator used in this project is a Two-Class Boosted Decision Tree classifier. Some of the features used to train the model are age, education, occupation, etc. Once you have scored and evaluated the model on the test data, you will deploy the trained model as an Azure Machine Learning web service. In just under an hour, you will be able to send new data to the web service API and receive the resulting predictions. This course runs on Coursera's hands-on project platform called Rhyme. On Rhyme, you do projects in a hands-on manner in your browser. You will get instant access to pre-configured cloud desktops containing all of the software and data you need for the project. Everything is already set up directly in your internet browser so you can just focus on learning. For this project, you'll get instant access to a cloud desktop with Python, Jupyter, and scikit-learn pre-installed.",
                "provider": "Coursera",
                "duration": "2:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/projects/azure-machine-learning-studio-pipeline",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "494",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_357",
                "courseTitle": "Launch Your Salesforce Career: Newbie to Paid Professional",
                "Tech_Skill": "Bash",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Bash, Shell, Linux, Scripting",
                "outcomeLearning": "You'll learn the essential basics to Salesforce from no knowledge to paid expert knowledge.\nYou'll learn how to land your first Salesforce admin job right out of the gates. You'll master admin skills that will have you ready and prepared for your first Salesforce administrator job. You'll gain a deep understanding of the direction you can take your Salesforce career.",
                "provider": "Udemy",
                "duration": "11:21:00",
                "feeVND": "322078.0",
                "URL": "https://www.udemy.com/course/how-to-get-a-salesforce-job/",
                "language": "English",
                "rating": "4.4",
                "peopleRating": "0",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_370",
                "courseTitle": "Introduction to Power BI",
                "Tech_Skill": "Microsoft Power BI",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Microsoft Power BI, BI",
                "outcomeLearning": "Gain a 360° overview of how to explore and use Power BI to build impactful reports. In this course, you'll go from zero to hero, as you discover how to use this popular business intelligence platform through hands-on exercises. You'll first learn how to confidently load and transform data using Power Query and the importance of data models, before diving into creating visualizations using Power BI's drag-and-drop functionality. You'll also learn how to drill-down into reports and make your reports fully interactive. Lastly, you'll level-up your skills using DAX (Data Analysis Expressions) formulas to create customized calculated columns and fields to better analyze your data. Get started now. You've got the power!",
                "provider": "Datacamp",
                "duration": "6:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/introduction-to-power-bi",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            }
        ],
        "Exception": [
            {
                "lstSkill_Provider": "GitHub, Kubernetes, Python, SAAS, Microsoft Excel, Tableau, DNS, Linux, Amazon Web Services (AWS), Google Cloud, CI/CD, Azure Databricks, TCP/IP, XML, Docker, Microsoft Azure, Bash, Microsoft Power BI",
                "lstSkill_notProvider": "Microsoft Office, Microsoft PowerPoint, Microsoft Word, Financial, IBM Db2, RPG, SAP ECC, Microsoft Outlook, Sisense, Microsoft Dynamics CRM 365, Microsoft Dynamics GP, Apache Airflow, ETL, Pycharm, Redshift, Amazon S3, Data Lake, Risk Management, Microsoft Visio, Workforce Management (WFM), Software Architect (SA), Chef, Datadog, Elastic Search, GitLab, Jenkins, Puppet, Splunk, VLAN"
            }
        ],
        "Ngoai_Le": {
            "Course_Offer": [],
            "ExceptionDetail": []
        }
    },
    "courses_offline": {
        "status": 400,
        "message": "no courses",
        "Course": [],
        "Exception": [
            {
                "job_offer": "Lead Data Analyst, Senior DevOps Engineer, Senior Data Scientist, Data Manager, Junior Project Manager"
            }
        ],
        "Ngoai_Le": {
            "Course_Offer": [],
            "ExceptionDetail": []
        }
    }
}