{
    "courses_online": {
        "status": 200,
        "message": "PASS",
        "Course": [
            {
                "courseID": "COURSE_184",
                "courseTitle": "IBM Applied AI Professional Certificate",
                "Tech_Skill": "AI, API, Deep Learning, Machine Learning, NumPy, OpenCV, Pandas, Python",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "OpenCV, IBM Watson Studio, AI, Python, API, Deep Learning, Pandas, NumPy, Machine Learning, Neural Network, APIs",
                "outcomeLearning": "Understand the definition of AI, its applications and use cases, and explain terms like machine learning, deep learning, and neural networks. Create AI chatbots and virtual assistants without any programming and deploy them on a website. Build AI-powered solutions using IBM Watson AI services, APIs, and Python with minimal coding. Apply computer vision techniques using Python, OpenCV, & Watson and develop custom image classification models and deploy them to the Cloud.",
                "provider": "Coursera",
                "duration": "18:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/professional-certificates/applied-artifical-intelligence-ibm-watson-ai",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish, Korean",
                "rating": "4.6",
                "peopleRating": "4548",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_032",
                "courseTitle": "Back-End Engineer1",
                "Tech_Skill": "GitHubPostgreSQLRDBMS",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Kubernetes, PostgreSQL, JavaScript, Scrum, OOP, SQL, Oauth, Node.js, HTTP, Express.js, GitHub, Git, Agile, YAGNI, Docker, KISS, Azure DevOps, API, TDD, Design Patterns, RDBMS, DRY, SOLID, Linear Data Structures, Complex Data Structures, Search Algorithm",
                "outcomeLearning": "Setting Up Your Dev Environment. Learn about the field of web development and the tools developers use to create websites. JavaScript Syntax, Part I. Get introduced to JavaScript and get comfortable with the basics of writing JavaScript programs. JavaScript Syntax, Part II. Discover more JavaScript techniques and features including arrays, looping, and objects. Git and Github, Part I. Learn how to use the Git version control system to keep track of changes and document your work. Then learn markdown and publish your first. JavaScript Syntax Portfolio Project. Build a Node.js console app that generates random messages each time a user runs the program and version your project with Git/GitHub. Basics of Back-End Development. Start learning about back-end development and programming servers. JavaScript Syntax, Part III. Understand intermediate JavaScript concepts, such as classes, modules, and error handling. Fundamentals of Operating Systems. Learn about how Operating Systems work. Build a Back-End with Node/Express.js. Learn about the popular back-end environment, Node.js and how to create back-end servers and APIs in JavaScript using the popular Express.js. Test Driven Development with JavaScript. Understand the fundamentals of Test Driven Development (TDD) and how you can apply its principles when developing back-ends. Website Development Fundamentals. Be introduced to the field of front-end web development and create your first web page on the internet. Building Interactive Websites with JavaScript. Understand how JavaScript is used to add interactive experiences to a website. Async JavaScript and HTTP Requests. Learn about APIs (Application Programming Interfaces). Working with APIs will enable you to work with data stored on remote servers. Git and GitHub, Part II. Learn how to use Git and GitHub to collaborate efficiently with developers. Node/Express API Portfolio Project. You can use Node and Express to build an API that allows users to create and manage a personal budget. SQL for Back-End Development. Learn how to create tables, create, retrieve, and update data in SQL databases, and build a data-intensive web app. PostgreSQL Database. Much of the internet is the flow of information. Learn how databases store data so that it can be displayed on the web using PostgreSQL. Designing Relational Databases. Learn how to design relational databases that you can then implement in PostgreSQL advanced PostgreSQL. Learn about database performance and techniques for efficiently accessing data and maintaining optimal performance. Connecting Your Database to a Server\nLearn how to integrate a PostgreSQL database into your application. Deploying Your Server. Learn how to build an API with Node, Express, PostgreSQL and deploy it to Heroku. YAGNI, KISS, and DRY. Learn about different software principles. Object-Oriented Design & SOLID. Learn about object-oriented programming (OOP) and the principles of encapsulation, abstraction, inheritance, polymorphism as well as SOLID. Common Design Patterns. The goal of this unit is to introduce the concept of software design patterns. Software Architectural Patterns. Learn about the concept of architectural patterns as well as learn about specific patterns currently used by the development community. Relational Database and Software Architecture Portfolio Project\nTake your budget app one step further and add a new layer to the project by setting up a database. Security Basics. The goal of this unit is to introduce the basic concepts of web security including common threats, best practices and available technologies. Web Security. Learn intermediate concepts in web security and look at prevention techniques for common threats. Securing Your Server. Identify techniques you can use to secure your applications. Protecting Resources with OAuth. Learn how to protect your resources with authorization and authentication techniques. Database Security. Secure your databases from SQL injections and with security measures specifically for PostgreSQL. Introduction to Enterprise Development. Get an overview of the technologies involved in enterprise development. Caching & CDNs. Learn about how content is stored on different servers with caching and CDNs. Scaling Your Server. Learn different strategies for scaling your server. Alternative Technology Approaches. Get an introduction to several technologies that can expand your understanding of back-end architecture. Agile Methodologies. Learn about Agile methodologies and Scrum. Intro to DevOps Strategies. Learn about Continuous Integration and Continuous Delivery and how to implement them with GitHub Actions. Containerization with Docker. Learn about containerization technology and how to use services like Docker and Kubernetes. Security and Enterprise Portfolio Project. Build an API with Node, Express, and Postgres that uses authentication and authorization best practices to manage an online contest. Linear Data Structures. Begin interview preparation by learning the fundamentals of linear data structures. Complex Data Structures. Continue interview preparation by learning advanced applications of data structures.Algorithms. Continue interview preparation by learning the fundamentals of algorithms. Search & Graph Search Algorithms. Continue interview preparation by learning the fundamentals of search algorithms. Interview Skills. Review some key technical interview topics as well as soft skills which employers are looking for in potential candidates. Final Back-End Portfolio Project. Use everything you've learned in the path to build an API of your choosing.",
                "provider": "Codecademy",
                "duration": "2 months",
                "feeVND": "0.0",
                "URL": "https://www.codecademy.com/learn/paths/back-end-engineer-career-path",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_034",
                "courseTitle": "Full-Stack Software Engineer",
                "Tech_Skill": "GitHubGraph DatabasePostgreSQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "JavaScript, PostgreSQL, SQL, API, Node.js, JavaScript, GitHub, Git, TDD, Redux, Express.js, React, CSS, Graph Database, RESTful API, HTML, APIs, Linear Data Structures, Search Algorithm, Neo4J",
                "outcomeLearning": "Welcome to the Full-Stack engineer path. Getting Started with Full-Stack Engineering. Introduction to software engineering. Setting Up Your Dev Environment. Learn about the field of web development and the tools developers use to create websites. JavaScript Syntax, Part I. Get introduced to JavaScript and get comfortable with the basics of writing JavaScript programs. JavaScript Syntax, Part II. Discover more JavaScript techniques and features including arrays, looping, and objects. Git and Github, Part I. Learn how to use the Git version control system to keep track of changes and document your work. Then learn markdown and publish your first. JavaScript Syntax Portfolio Project. Build a Node.js console app that generates random messages each time a user runs the program and version your project with Git/GitHub. Web Development Fundamentals. Be introduced to the field of front-end web development and create your first web page on the internet. Bringing Your Site Online. Learn about different methods for hosting your site, like GitHub pages and how to use a custom domain name. Improved Styling with CSS. Dig deeper into CSS and improve your ability to layout and style websites. Building Interactive Websites with JavaScript. Understand how JavaScript is used to add interactive experiences to a website. Making a Website Responsive. Learn how to create websites that can be viewed on a variety of devices and use different layouts and positioning. Making a Website Accessible. Refactor your website to follow the best accessibility (a11y) practices. HTML, CSS, and JS Portfolio Project. Bring together what you have learned in the previous lessons and build a project off of Codecademy. JavaScript Syntax, Part III. Understand intermediate JavaScript concepts, such as classes, modules, and error handling. Test Driven Development with JavaScript. Be introduced to the fundamentals of Test Driven Development (TDD). Async JavaScript and HTTP Requests. Learn about APIs (Application Programming Interfaces). Working with APIs will enable you to work with data stored on remote servers. Web Apps. Be introduced to web applications and learn about single page applications (SPAs) and how they are different from static websites. React, Part I. Be introduced to the popular JavaScript library, React. React, Part II. Dive further into React and learn about props, state, hooks as well as testing with Jest and Enzyme. Learn Redux, the library most commonly used with React to manage application state. Git and GitHub, Part II. Learn how to use Git and GitHub to collaborate efficiently with developers. React and Redux Portfolio Project. Bring together what you have learned in the previous lessons and build a project off of Codecademy. Basics of Back-End Development. Start learning about back-end development and programming servers. Build a Back-End with Node/Express.js. Learn about the popular back-end environment, Node.js and how to create back-end servers and APIs in JavaScript using the popular Express.js. Back-End and Feature Testing. Learn about TDD techniques for full-stack web applications. SQL for Back-End Development. Learn how to create tables, create, retrieve, and update data in SQL databases, and build a data-intensive web app. PostgreSQL Database. Much of the internet is the flow of information. Learn how databases store data so that it can be displayed on the web using PostgreSQL. Designing Relational Databases. Learn how to design relational databases that you can then implement in PostgreSQL. advanced PostgreSQL. Learn about database performance and techniques for efficiently accessing data and maintaining optimal performance. Back-End Portfolio Project. Build an e-commerce REST API using Node/Express and PostgreSQL. Connecting Front-End to Back-End. Learn about the different ways to combine your front-end and back-end systems to create a cohesive full-stack application. Adding a PostgreSQL Database. Learn PostgreSQL to connect JS and SQL in web apps, and build your first fully-integrated app back-end. Security, Authentication, and Authorization. Learn how to make a web application secure. Advanced Concepts in TDD. Learn advanced Test Driven Development (TDD) concepts that will help to test your web application as a whole. Full-Stack Portfolio Project. Expand the e-commerce REST API with a React client app, creating a PERN (Postgres, Express, React, Node) full-stack e-commerce experience. Linear Data Structures. Begin interview preparation by learning the fundamentals of linear data structures. Complex Data Structures. Continue interview preparation by learning advanced applications of data structures. Continue interview preparation by learning the fundamentals of algorithms. Search & Graph Search Algorithms. Continue interview preparation by learning the fundamentals of search algorithms. Interview Skills. Review some key technical interview topics as well as soft skills which employers are looking for in potential candidates. Final Portfolio Project. Build a PERN app of your choosing and deploy it to Heroku.",
                "provider": "Codecademy",
                "duration": "01:52:00",
                "feeVND": "0.0",
                "URL": "https://www.codecademy.com/learn/paths/full-stack-engineer-career-path",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_179",
                "courseTitle": "Introduction to Data Science Specialization",
                "Tech_Skill": "GitHubJupyterRDBMS",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R, Jupyter, SQL, GitHub, IBM Watson Studio, R Studio, Python, RDBMS, Cloud Databases, Ipython",
                "outcomeLearning": "Describe what data science and machine learning are, their applications & use cases, and various types of tasks performed by data scientists. Gain hands-on familiarity with common data science tools including JupyterLab, R Studio, GitHub and Watson Studio. Develop the mindset to work like a data scientist, and follow a methodology to tackle different types of data science problems. Write SQL statements and query Cloud databases using Python from Jupyter notebooks",
                "provider": "Coursera",
                "duration": "12:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/introduction-data-science",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.7",
                "peopleRating": "9228",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_217",
                "courseTitle": "Introduction to Data Analytics",
                "Tech_Skill": "JupyterMicrosoft AzureScikit-learn",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Jupyter, Microsoft Azure, Machine Learning, Scikit-learn, Python, API, Microsoft Azure",
                "outcomeLearning": "This course presents a gentle introduction into the concepts of data analysis, the role of a Data Analyst, and the tools that are used to perform daily functions. You will gain an understanding of the data ecosystem and the fundamentals of data analysis, such as data gathering or data mining. You will then learn the soft skills that are required to effectively communicate your data to stakeholders, and how mastering these skills can give you the option to become a data driven decision maker. This course will help you to differentiate between the roles of a Data Analyst, Data Scientist, and Data Engineer. You will learn the responsibilities of a Data Analyst and exactly what data analysis entails. You will be able to summarize the data ecosystem, such as databases and data warehouses. You will then uncover the major vendors within the data ecosystem and explore the various tools on-premise and in the cloud. Continue this exciting journey and discover Big Data platforms such as Hadoop, Hive, and Spark. By the end of this course you will be able to visualize the daily life of a Data Analyst, understand the different career paths that are available for data analytics, and identify the many resources available for mastering this profession. Throughout this course you will learn the key aspects to data analysis. You will begin to explore the fundamentals of gathering data, and learning how to identify your data sources. You will then learn how to clean, analyze, and share your data with the use of visualizations and dashboard tools. This all comes together in the final project where it will test your knowledge of the course material, explore what it means to be a Data Analyst, and provide a real-world scenario of data analysis. This course does not require any prior data analysis, spreadsheet, or computer science experience. All you need to get started is basic computer literacy, high school level math, and access to a modern web browser such as Chrome or Firefox.",
                "provider": "Coursera",
                "duration": "11:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/learn/introduction-to-data-analytics",
                "language": "Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, English, Spanish",
                "rating": "4.8",
                "peopleRating": "3632",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_224",
                "courseTitle": "Data Science Fundamentals with Python and SQL Specialization 1",
                "Tech_Skill": "GitHubJupyter",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R, GitHub, NumPy, SQL, IBM Watson Studio, API, Jupyter, R Studio, Python, Pandas, Ipython, Probability, Statistics, Data Visualization, Statistical Hypothesis Testing, Cloud Databases",
                "outcomeLearning": "Working knowledge of Data Science Tools such as Jupyter Notebooks, R Studio, GitHub, Watson Studio. Python programming basics including data structures, logic, working with files, invoking APIs, and libraries such as Pandas and Numpy. Statistical Analysis techniques including Descriptive Statistics, Data Visualization, Probability Distribution, Hypothesis Testing and Regression. Relational Database fundamentals including SQL query language, Select statements, sorting & filtering, database functions, accessing multiple tables",
                "provider": "Udemy",
                "duration": "18:00:00",
                "feeVND": "20616200.0",
                "URL": "https://www.coursera.org/specializations/data-science-fundamentals-python-sql",
                "language": "Arabic, French, Portuguese, Italian, German, Russian, Spanish, Vietnamese, English",
                "rating": "4.6",
                "peopleRating": "583",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_180",
                "courseTitle": "Data Science Fundamentals with Python and SQL Specialization",
                "Tech_Skill": "GitHubJupyter",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R, GitHub, NumPy, SQL, IBM Watson Studio, API, Jupyter, R Studio, Python, Pandas, Ipython, Probability, Statistics, Data Visualization, Statistical Hypothesis Testing, Cloud Databases",
                "outcomeLearning": "Working knowledge of Data Science Tools such as Jupyter Notebooks, R Studio, GitHub, Watson Studio. Python programming basics including data structures, logic, working with files, invoking APIs, and libraries such as Pandas and Numpy. Statistical Analysis techniques including Descriptive Statistics, Data Visualization, Probability Distribution, Hypothesis Testing and Regression. Relational Database fundamentals including SQL query language, Select statements, sorting & filtering, database functions, accessing multiple tables",
                "provider": "Coursera",
                "duration": "2 months",
                "feeVND": "20616200.0",
                "URL": "https://www.coursera.org/specializations/data-science-fundamentals-python-sql",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.6",
                "peopleRating": "583",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_223",
                "courseTitle": "IBM Data Analyst Professional Certificate 1",
                "Tech_Skill": "JupyterMatplotlib",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Microsoft Excel, Matplotlib, NumPy, SQL, Cognos, Amazon Web Services (AWS), Python, API, Pandas, Jupyter, Data Visualization, Pivot Table, Dashboard, Pandas, APIs",
                "outcomeLearning": "Demonstrate proficiency in using spreadsheets and utilizing Excel to perform a variety of data analysis tasks like data wrangling and data mining. Create various charts and plots in Excel & work with IBM Cognos Analytics to build dashboards. Visualize data using Python libraries like Matplotlib. Develop working knowledge of Python language for analyzing data using Python libraries like Pandas and Numpy, and invoke APIs and Web Services. Describe data ecosystem and Compose queries to access data in cloud databases using SQL and Python from Jupyter Notebooks",
                "provider": "Udemy",
                "duration": "09:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.7",
                "peopleRating": "4832",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_177",
                "courseTitle": "IBM Data Analyst Professional Certificate",
                "Tech_Skill": "JupyterMatplotlib",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Microsoft Excel, Matplotlib, NumPy, SQL, Cognos, Amazon Web Services (AWS), Python, API, Pandas, Jupyter, Data Visualization, Pivot Table, Dashboard, Pandas, APIs",
                "outcomeLearning": "Demonstrate proficiency in using spreadsheets and utilizing Excel to perform a variety of data analysis tasks like data wrangling and data mining. Create various charts and plots in Excel & work with IBM Cognos Analytics to build dashboards. Visualize data using Python libraries like Matplotlib. Develop working knowledge of Python language for analyzing data using Python libraries like Pandas and Numpy, and invoke APIs and Web Services. Describe data ecosystem and Compose queries to access data in cloud databases using SQL and Python from Jupyter Notebooks",
                "provider": "Coursera",
                "duration": "09:00:00",
                "feeVND": "414166.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.7",
                "peopleRating": "4832",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_181",
                "courseTitle": "IBM Data Analytics with Excel and R Professional Certificate",
                "Tech_Skill": "Jupyter, RDBMS",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R, R Studio, Jupyter, RDBMS, SQL, Microsoft Excel, Pivot Table, Data Visualization, Cognos, Spreadsheet, R Shiny",
                "outcomeLearning": "Manipulate numeric and textual data types using the R programming language and RStudio or Jupyter Notebooks. Define and manipulate R data structures, including vectors, factors, lists, and data frames. Control program flow, define functions, perform character string and date operations, define regular expressions, and handle errors. Read, write, and save data files and scrape web pages using R.",
                "provider": "Coursera",
                "duration": "22:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst-r-excel",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.8",
                "peopleRating": "270",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_220",
                "courseTitle": "Data Engineering Foundations Specialization",
                "Tech_Skill": "PostgreSQLRDBMS",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "MySQL, ETL, NumPy, SQL, PostgreSQL, IBM Db2, API, Python, Pandas, RDBMS, DBMS, NoSQL, NumPy, Web Scraping",
                "outcomeLearning": "Working knowledge of Data Engineering Ecosystem and Lifecycle. Viewpoints and tips from Data professionals on starting a career in this domain. Relational Database fundamentals including Database Design, Creating Schemas, Tables, Constraints, and working with MySQL, PostgreSQL & IBM Db2. Python programming basics including data structures, logic, working with files, invoking APIs, using libraries such as Pandas and Numpy, doing ETL. SQL query language, SELECT, INSERT, UPDATE, DELETE statements, database functions, stored procs, working with multiple tables, JOINs, & transactions.",
                "provider": "Coursera",
                "duration": "18:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/data-engineering-foundations",
                "language": "English",
                "rating": "4.7",
                "peopleRating": "380",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_020",
                "courseTitle": "Computer Science",
                "Tech_Skill": "Graph DatabasePostgreSQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Python, Data Structures, Graph Database, Command Line, Git, PostgreSQL",
                "outcomeLearning": "Introduction to Programming. Kickstart your coding life as you learn all about the programming language Python and the techniques used when writing it. Development Skills. Learn about the tools for software development. Learn to navigate the terminal and keep snapshots of your work using git. Flow, Data, and iteration. Learn all about control flow, storage of data in Python, and how to loop over things. Build a Tourism Recommendation Engine. Develop your own application using the Python programming language, the terminal, and git! Use your coding skills to make a tourism recommendation service. Python Objects. Learn about creating and using objects in Python with these courses on some of the most commonly used data types. Then unlock your full potential by learning how to create your own with classes. Create an Art Marketplace. Learn about building and creating data types and objects in this course that focuses on creating a specialized marketplace for art traders. Linear Data Structures. Learn about virtualization of computer memory by building the fundamental data structures of computer science: lists, stacks, and queues. Learn Complex Data Structures. Discover and design new data structures that follow abstract rule-based systems by building out graphs, hash-maps, and heaps. Data Structures Review. After learning about data structures, take some time to review and compare them. Asymptotic Notation. Learn how to analyze performance of algorithms in a general way using asymptotic notation. Learn Recursion with Python. Recursion gives you a new perspective on problem-solving by defining a problem in terms of itself. Learn Sorting Algorithms with Python. Learn about the usefulness and efficiency of computational sorting by implementing different sorting algorithms yourself. How to Implement Search Algorithms with Python. Finding the data you are looking for in a data set is an important skill: get started with two common approaches. Graph Search Algorithms. Learn how to explore and graph the information you are looking for.",
                "provider": "Codecademy",
                "duration": "16:00:00",
                "feeVND": "0.0",
                "URL": "https://www.codecademy.com/learn/paths/computer-science",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_186",
                "courseTitle": "Data Science: Foundations using R Specialization",
                "Tech_Skill": "GitHubRegex",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R Studio, R, GitHub, Machine Learning, DML, Regex, Data Cleansing",
                "outcomeLearning": "Use R to clean, analyze, and visualize data. Learn how to ask the right questions, obtain data, and perform reproducible research. Use GitHub to manage data science projects. Set up R, R-Studio, Github and other useful tools",
                "provider": "Coursera",
                "duration": "16:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/data-science-foundations-r",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.6",
                "peopleRating": "5167",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_130",
                "courseTitle": "Microsoft Azure - Beginner's Guide + AZ-900 - UPDATED 2021",
                "Tech_Skill": "PostgreSQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Kubernetes, Azure SQL Database, PostgreSQL, Azure Bot Service, Azure Region, CosmosDB, Virtual Machine, Azure Logic Apps, Azure DevOps, Azure Functions, Azure Container Instances, Azure Data Factory, MySQL, Azure Storage, Azure Marketplace, Azure VM Scale Sets, Azure Security Center, Azure Synapse Analytics, AWS Cloud, .NET",
                "outcomeLearning": "This course is designed to help students get themselves familiar with Microsoft's Cloud platform , Microsoft Azure. In this course you will learn the following: creating a Free Account in Azure, working with Virtual Machines, working with Azure Storage - Blob, table, queues, files, introduction to Azure SQL Databases and CosmosDB, basic Networking concepts in Azure, a basic understanding on various services such as Azure Functions , Azure Logic Apps , Azure Scale Sets etc.\nAdded new chapters to the course including the following: Azure Synapse Analytics-Creating a workspace and dedicated SQL pool, lab - Azure Synapse - setting up Azure SQL and Azure Data Factory, lab - Azure Synapse - transferring data Azure Data Factory, Azure Bot Service, also added a completely new section to serve as a good revision for key concepts discussed in the course, updated chapters on .Net programs for working with the Blob and queue service in Azure Storage Accounts, performed a revision of the practice test questions - added 30 new questions, lab on Azure Kubernetes, the various tools in Azure DevOps services, Shared Responsibility Model, Azure Database for MySQL and PostgreSQL, Azure Security Center, availability sets and availability zones understanding, Azure storage accounts - Blob and file service, added more practice questions to the Exam section, refreshed the chapters on Azure Regions, Deploying a Windows Virtual Machine, Azure Marketplace, updated chapters on Network Security Groups , Azure SQL database , Azure Web Apps , Communication within an Azure virtual network, added chapters on Example Invoice, Azure Container Instances, Availability Zones implementation, refreshed several chapters including the creation of virtual machines, Azure Functions , Azure Logic Apps to reflect User Interface changes in Azure.",
                "provider": "Udemy",
                "duration": "13:06:00",
                "feeVND": "322078.0",
                "URL": "https://www.udemy.com/course/microsoft-azure-beginners-guide/",
                "language": "English, French, German, Indonesian, Italian, Portuguese, Spanish",
                "rating": "4.5",
                "peopleRating": "30096",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_183",
                "courseTitle": "IBM Full Stack Cloud Developer Professional Certificate",
                "Tech_Skill": "GitHub",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Bootstrap, Kubernetes, Django, Cloud Native, React, JavaScript, GitHub, CSS, Microservices, HTML, Node.js, Python, Containers, Openshift, Cloud Computing, Azure DevOps, IaaS, PAAS, SAAS, Hybrid Multicloud",
                "outcomeLearning": "Develop with front-end development languages and tools such as HTML, CSS, JavaScript, React and Bootstrap. Program applications using back-end languages and frameworks like Express, Node.js, Python, Django, etc. Deploy and scale applications using Cloud Native methodologies and tools like Containers, Kubernetes, Microservices and Serverless Functions. Build your GitHub portfolio by applying your Full Stack Cloud Development skills with multiple labs and hands-on projects, including a capstone",
                "provider": "Coursera",
                "duration": "22:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-full-stack-cloud-developer",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.6",
                "peopleRating": "355",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_144",
                "courseTitle": "Applied Linux Command Line and Shell Scripting Zero to Elite",
                "Tech_Skill": "Linux",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Tmux, Git, CSysdig, iproute2, DNS, SSH, Windows, SOCKS, IPTables, Linux",
                "outcomeLearning": "Learning +200 modern Linux tools & commands with their use-cases.\nHandling basic to complex real-work Linux projects: network, security, system visibility, etc.\nProject-based shell scripting & automation: writing a backup tool, a password manager, etc.\nTerminal productivity using Tmux, Git, Oh My Zsh, Nerd Font, Windows Terminal, etc.\nManage Linux components in shell e.g. networking, disks, processes, users, etc.\nAdvanced system visibility using sysdig & CSysdig (Lua Scripts).\nProblem-solving mindset, both in theory & do-along.\nLinux Networking & DNS, route & adapter management with iproute2, etc.\nIn-depth IPTables e.g. filter, nat, mangle etc.\nDive in Linux Firewall.\nCovering complete SSH Technologies OpenSSH Server, SSH Port Forwarding & Tunneling, SOCKS Proxy, etc.\nTask automation using cron & other daemons.\nGet the most out of 1-second booting subsystem-Linux: WSL2.\nInstallation & setting up a virtual Linux Lab (VirtualBox).\nVendor-neutral approach, supporting any Linux Distros inspired by LPIC Certification.",
                "provider": "Udemy",
                "duration": "09:01:00",
                "feeVND": "322078.0",
                "URL": "https://www.udemy.com/course/complete-linux-command-line-and-terminal-productivity/",
                "language": "English",
                "rating": "4.4",
                "peopleRating": "544",
                "location": "",
                "level": "ALL Levels",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_192",
                "courseTitle": "AWS Fundamentals Specialization",
                "Tech_Skill": "Google Cloud",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "REST, Amazon Web Services (AWS), Amazon GuardDuty, Amazon CloudTrail, AWS Security Hub, Google Cloud, AWS Lambda, Amazon Lex",
                "outcomeLearning": "You will be able to make an informed decision about when and how to apply key AWS services for compute, storage, and database to different use cases. Foundational security concepts, including basic concepts such as \"least privilege\" and the \"Shared Responsibility Model\". Detective controls, including Amazon CloudTrail, AWS Security Hub, Amazon GuardDuty, and AWS Config. Encryption of data at rest, in motion, and best practices for how to store data within and between various AWS services.",
                "provider": "Coursera",
                "duration": "12:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/aws-fundamentals",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish, Korean",
                "rating": "4.6",
                "peopleRating": "9516",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_174",
                "courseTitle": "Coding for Everyone: C and C++ Specialization",
                "Tech_Skill": "C++",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Graph Theory, STL, C++, C",
                "outcomeLearning": "This Specialization is intended for all programming enthusiasts, as well as beginners, computer and other scientists, and artificial intelligence enthusiasts seeking to develop their programming skills in the foundational languages of C and C++. Through the four courses — two in C, and two in C++ — you will cover the basics of programming in C and move on to the more advanced C++ semantics and syntax, which will prepare you to apply these skills to a number of higher-level problems using AI algorithms and Monte Carlo evaluation in complex games.",
                "provider": "Coursera",
                "duration": "12:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/coding-for-everyone",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.4",
                "peopleRating": "1223",
                "location": "",
                "level": "Beginner",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_152",
                "courseTitle": "Linear Classifiers in Python",
                "Tech_Skill": "Scikit-learn",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Logistic Regression, Machine Learning, SVM, Scikit-learn, Python",
                "outcomeLearning": "In this course you'll learn all about using linear classifiers, specifically Logistic Regression and Support Vector Machines, with scikit-learn. Once you've learned how to apply these methods, you'll dive into the ideas behind them and find out what really makes them tick. At the end of this course you'll know how to train, test, and tune these linear classifiers in Python. You'll also have a conceptual foundation for understanding many other Machine Learning algorithms.",
                "provider": "Datacamp",
                "duration": "04:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/linear-classifiers-in-python",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_157",
                "courseTitle": "Cloud Computing for Everyone",
                "Tech_Skill": "Microsoft Azure",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Salesforce, Microsoft Azure, Amazon Web Services (AWS)",
                "outcomeLearning": "Every day we interact with the cloud—whether it's using Google Drive, apps like Salesforce, or accessing our favorite websites. Cloud computing has become the norm for many companies, but what exactly is the cloud and why is everyone rushing to adopt it? Designed for absolute novices, this course breaks down what the cloud is and explains terminology such as scalability, latency, and high-availability. You'll learn about the many advantages including ease of remote collaboration, how there are no hardware limitations, and reliable disaster recovery. You'll also discover the range of tools provided by major cloud providers such as Amazon Web Services (AWS), Microsoft Azure, and Google Cloud. By the end of this course, you'll be able to confidently explain how cloud tools can increase productivity and save money, as well as ask the right questions about how to optimize your use of cloud tools.",
                "provider": "Datacamp",
                "duration": "02:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/cloud-computing-for-everyone",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_165",
                "courseTitle": "Introduction to PySpark",
                "Tech_Skill": "PySpark",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "PySpark, Python, Apache Spark",
                "outcomeLearning": "In this course, you'll learn how to use Spark from Python! Spark is a tool for doing parallel computation with large datasets and it integrates well with Python. PySpark is the Python package that makes the magic happen. You'll use this package to work with data about flights from Portland and Seattle. You'll learn to wrangle this data and build a whole machine learning pipeline to predict whether or not flights will be delayed. Get ready to put some Spark in your Python code and dive into the world of high-performance machine learning!",
                "provider": "Datacamp",
                "duration": "04:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/introduction-to-pyspark",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_163",
                "courseTitle": "Introduction to Data Visualization with Matplotlib",
                "Tech_Skill": "Matplotlib",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Matplotlib, Python",
                "outcomeLearning": "Visualizing data in plots and figures exposes the underlying patterns in the data and provides insights. Good visualizations also help you communicate your data to others, and are useful to data analysts and other consumers of the data. In this course, you will learn how to use Matplotlib, a powerful Python data visualization library. Matplotlib provides the building blocks to create rich visualizations of many different kinds of datasets. You will learn how to create visualizations for different kinds of data and how to customize, automate, and share these visualizations.",
                "provider": "Datacamp",
                "duration": "04:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/introduction-to-data-visualization-with-matplotlib",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "is_online": "true"
            }
        ],
        "Exception": [
            {
                "lstSkill_Provider": "AI, API, Deep Learning, Machine Learning, NumPy, OpenCV, Pandas, Python, Jupyter, RDBMS, PostgreSQL, GitHub, Linux, Google Cloud, C++, Scikit-learn, Microsoft Azure, PySpark, Matplotlib",
                "lstSkill_notProvider": "Beautiful Soup, CNN, Datalab, GANs, Google Colab, Kaggle, Keras, LSTM, Librosa, PIL, Pytorch, RNN, Regex, Seaborn, NLTK, Cognitive Computing, Elastic Search, Graph Database, IBM BlueMix, Apache Solr"
            },
            {
                "ExceptionType": "Fee",
                "Input": "5000000.0",
                "Output": "42290720.0",
                "Balance": "37290720.0"
            },
            {
                "ExceptionType": "Duration",
                "Input": "3 days, 0:00:00",
                "Output": "135 days, 3:07:00",
                "Balance": "132 days, 3:07:00"
            }
        ],
        "Ngoai_Le": {
            "Course_Offer": [],
            "ExceptionDetail": []
        }
    },
    "courses_offline": {
        "status": 201,
        "message": "frameRemain_Fulltime",
        "Course": [
            {
                "courseID": "COURSE_268",
                "courseTitle": "[HN] Python/Machine Learning",
                "Tech_Skill": "Google Colab, Jupyter, Matplotlib, NumPy, Pandas, Python",
                "studyTime": "18:00-21:00 (3 - 5)|08:30-11:30 (7)",
                "studyForm": "Part time",
                "technologySkill": "Python, NumPy, Pandas, Matplotlib, ScikitLearn, Git, Visual Studio Code, PyCharm, Jupyter, Google Colab",
                "outcomeLearning": "Provides you with the most commonly used knowledge and skills and is especially useful for any Machine Learning programmer. Upon completion of this course, you will have the following knowledge and skills: Specific core knowledge of the Python programming language; The data structures provided by Python and the methods available for each of the different data structures: String, List, Dictionary, Tuple, Set.; Compile, debug and execute the program on an IDE (Visual Studio Code, Pycharm...). Install and use Python libraries: Numpy, Pandas, Matplotlib, Scikit-learn. Provides knowledge about common problem types in machine learning, popular machine learning algorithms, and ways to evaluate model performance. A series of Lab exercises associated with the lessons help learners practice and practice skills and apply the knowledge they have learned. The completed student is able to: Be skilled in handling various types of data collected from various sources and aggregated in a form usable for machine learning. Have the skills to observe, analyze and visualize data to help make effective decisions. Understand and effectively apply various machine learning algorithms and technologies to other types of labeled and unlabeled data in practice. Good knowledge of common problem types in machine learning. Understand some of the parameters related to each machine learning algorithm and know how to customize it to improve the performance of the model. Applying and implementing important algorithms of supervised learning (Supervised Learning) and unsupervised learning (Unsupervised learning). Applying and implementing important algorithms belonging to the Recommendation System group. Understanding of precision metrics such as mean square error, confusion matrix, F1 score, R-squared, precision calculation methods and applying appropriate accuracy metrics for each machine learning problem.",
                "provider": "FPT Software Acedemy",
                "duration": "2 months",
                "feeVND": "13900000.0",
                "URL": "https://fsoft-academy.edu.vn/vi/khoa-hoc/hn-pythonmachine-learning-28",
                "language": "Vietnamese, Japanese",
                "rating": "",
                "peopleRating": "",
                "location": "Ha Noi, Cau Giay, Duy Tan",
                "level": "Beginner",
                "is_online": "false"
            }
        ],
        "Exception": [
            {
                "ExceptionType": "Frame_Remain",
                "frame_remain": "18:00-21:00 (3 - 5)|08:30-11:30 (7)"
            },
            {
                "ExceptionType": "Fee",
                "Input": "5000000.0",
                "Output": "13900000.0",
                "Balance": "8900000.0"
            },
            {
                "ExceptionType": "Duration",
                "Input": "3 days, 0:00:00",
                "Output": "60 days, 0:00:00",
                "Balance": "57 days, 0:00:00"
            },
            {
                "lstSkill_Provider_ngoaile": "Google Colab, Jupyter, Matplotlib, NumPy, Pandas, Python",
                "lstSkill_notProvider_ngoaile": "Beautiful Soup, CNN, Datalab, GANs, Kaggle, Keras, LSTM, Librosa, PIL, Pytorch, RNN, Regex, Seaborn, NLTK, Cognitive Computing, Elastic Search, Graph Database, IBM BlueMix, Apache Solr"
            }
        ],
        "Ngoai_Le": {
            "Course_Offer": [],
            "ExceptionDetail": []
        }
    }
}