{
    "courses_online": {
        "status": 200,
        "message": "PASS",
        "Course": [
            {
                "courseID": "COURSE_224",
                "courseTitle": "Data Science Fundamentals with Python and SQL Specialization 1",
                "Tech_Skill": "NumPy, Python, R, SQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R, GitHub, NumPy, SQL, IBM Watson Studio, API, Jupyter, R Studio, Python, Pandas, Ipython, Probability, Statistics, Data Visualization, Statistical Hypothesis Testing, Cloud Databases",
                "outcomeLearning": "Working knowledge of Data Science Tools such as Jupyter Notebooks, R Studio, GitHub, Watson Studio. Python programming basics including data structures, logic, working with files, invoking APIs, and libraries such as Pandas and Numpy. Statistical Analysis techniques including Descriptive Statistics, Data Visualization, Probability Distribution, Hypothesis Testing and Regression. Relational Database fundamentals including SQL query language, Select statements, sorting & filtering, database functions, accessing multiple tables",
                "provider": "Udemy",
                "duration": "18:00:00",
                "feeVND": "21089000.0",
                "URL": "https://www.coursera.org/specializations/data-science-fundamentals-python-sql",
                "language": "Arabic, French, Portuguese, Italian, German, Russian, Spanish, Vietnamese, English",
                "rating": "4.6",
                "peopleRating": "583",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_180",
                "courseTitle": "Data Science Fundamentals with Python and SQL Specialization",
                "Tech_Skill": "NumPy, Python, R, SQL",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "R, GitHub, NumPy, SQL, IBM Watson Studio, API, Jupyter, R Studio, Python, Pandas, Ipython, Probability, Statistics, Data Visualization, Statistical Hypothesis Testing, Cloud Databases",
                "outcomeLearning": "Working knowledge of Data Science Tools such as Jupyter Notebooks, R Studio, GitHub, Watson Studio. Python programming basics including data structures, logic, working with files, invoking APIs, and libraries such as Pandas and Numpy. Statistical Analysis techniques including Descriptive Statistics, Data Visualization, Probability Distribution, Hypothesis Testing and Regression. Relational Database fundamentals including SQL query language, Select statements, sorting & filtering, database functions, accessing multiple tables",
                "provider": "Coursera",
                "duration": "2 months",
                "feeVND": "21089000.0",
                "URL": "https://www.coursera.org/specializations/data-science-fundamentals-python-sql",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.6",
                "peopleRating": "583",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_197",
                "courseTitle": "Data Visualization with Tableau Specialization",
                "Tech_Skill": "SAS, Tableau",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Tableau, SAS, Storyboarding, Data Visualization",
                "outcomeLearning": "Examine, navigate, and learn to use the various features of Tableau. Assess the quality of the data and perform exploratory analysis. Create and design visualizations and dashboards for your intended audience. Combine the data to and follow the best practices to present your story.",
                "provider": "Coursera",
                "duration": "18:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/data-visualization",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.5",
                "peopleRating": "5567",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_136",
                "courseTitle": "Programming for the Web with JavaScript",
                "Tech_Skill": "MongoDB",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Node.js, Bootstrap, JavaScript, jQuery, DOM, React, CSS, MongoDB, D3.js, NoSQL, HTML, Json, RESTful API, API, SQL",
                "outcomeLearning": "JavaScript is the programming language of the World Wide Web.\nAs a professional web software developer, you will not only need to know how to program in this simple yet powerful language, but you will need to understand the fundamentals of how data is exchanged on the World Wide Web (WWW) and what tools and frameworks are available to you for creating robust, interactive web applications.\nThis course, part of the CS Essentials for Software Development Professional Certificate program, provides an introduction to modern web development using JavaScript. In addition to exploring the basics of web page creation using HTML and CSS, you will learn advanced web page layout and responsive design tools such as Bootstrap. You will also learn how browsers represent a web page data using the Document Object Model (DOM) and how to develop dynamic, interactive web pages using JavaScript in the browser. Beyond fundamental JavaScript syntax and advanced language features such as callbacks, events, and asynchronous programming, you will work with jQuery, which provides functionality for simplified DOM manipulation and event handling.\nThis course will also introduce you to modern web frameworks and component-based libraries such as React.js for efficiently developing modular web page components, and D3.js for creating data-driven documents. We will also teach you how to represent and exchange data using JavaScript Object Notation (JSON), and how to access RESTful APIs on the web.\nServer-side JavaScript is becoming more prevalent in the industry, with web frameworks such as Node.js and Express making it simple to create and deploy complex, data-driven web applications. This course will prepare you to use such frameworks and show you how to integrate them with NoSQL databases such as MongoDB.",
                "provider": "Edx",
                "duration": "08:00:00",
                "feeVND": "0.0",
                "URL": "https://www.edx.org/course/programming-for-the-web-with-javascript",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_223",
                "courseTitle": "IBM Data Analyst Professional Certificate 1",
                "Tech_Skill": "Amazon Web Services (AWS)",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Microsoft Excel, Matplotlib, NumPy, SQL, Cognos, Amazon Web Services (AWS), Python, API, Pandas, Jupyter, Data Visualization, Pivot Table, Dashboard, Pandas, APIs",
                "outcomeLearning": "Demonstrate proficiency in using spreadsheets and utilizing Excel to perform a variety of data analysis tasks like data wrangling and data mining. Create various charts and plots in Excel & work with IBM Cognos Analytics to build dashboards. Visualize data using Python libraries like Matplotlib. Develop working knowledge of Python language for analyzing data using Python libraries like Pandas and Numpy, and invoke APIs and Web Services. Describe data ecosystem and Compose queries to access data in cloud databases using SQL and Python from Jupyter Notebooks",
                "provider": "Udemy",
                "duration": "09:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.7",
                "peopleRating": "4832",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_177",
                "courseTitle": "IBM Data Analyst Professional Certificate",
                "Tech_Skill": "Amazon Web Services (AWS)",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Microsoft Excel, Matplotlib, NumPy, SQL, Cognos, Amazon Web Services (AWS), Python, API, Pandas, Jupyter, Data Visualization, Pivot Table, Dashboard, Pandas, APIs",
                "outcomeLearning": "Demonstrate proficiency in using spreadsheets and utilizing Excel to perform a variety of data analysis tasks like data wrangling and data mining. Create various charts and plots in Excel & work with IBM Cognos Analytics to build dashboards. Visualize data using Python libraries like Matplotlib. Develop working knowledge of Python language for analyzing data using Python libraries like Pandas and Numpy, and invoke APIs and Web Services. Describe data ecosystem and Compose queries to access data in cloud databases using SQL and Python from Jupyter Notebooks",
                "provider": "Coursera",
                "duration": "09:00:00",
                "feeVND": "414166.0",
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst",
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.7",
                "peopleRating": "4832",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_134",
                "courseTitle": "Python Basics for Data Science",
                "Tech_Skill": "Python",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "IBM Watson Studio, Python, Jupyter",
                "outcomeLearning": "Kickstart your learning of Python for data science, as well as programming in general with this introduction to Python course. This beginner-friendly Python course will quickly take you from zero to programming in Python in a matter of hours and give you a taste of how to start working with data in Python. Upon its completion, you'll be able to write your own Python scripts and perform basic hands-on data analysis using our Jupyter-based lab environment. If you want to learn Python from scratch, this course is for you. You can start creating your own data science projects and collaborating with other data scientists using IBM Watson Studio. When you sign up, you will receive free access to Watson Studio. Start now and take advantage of this platform and learn the basics of programming, machine learning, and data visualization with this introductory course.",
                "provider": "Edx",
                "duration": "06:00:00",
                "feeVND": "0.0",
                "URL": "https://www.edx.org/course/python-basics-for-data-science",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_165",
                "courseTitle": "Introduction to PySpark",
                "Tech_Skill": "Python",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "PySpark, Python, Apache Spark",
                "outcomeLearning": "In this course, you'll learn how to use Spark from Python! Spark is a tool for doing parallel computation with large datasets and it integrates well with Python. PySpark is the Python package that makes the magic happen. You'll use this package to work with data about flights from Portland and Seattle. You'll learn to wrangle this data and build a whole machine learning pipeline to predict whether or not flights will be delayed. Get ready to put some Spark in your Python code and dive into the world of high-performance machine learning!",
                "provider": "Datacamp",
                "duration": "04:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/introduction-to-pyspark",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_151",
                "courseTitle": "Machine Learning with Tree-Based Models in Python",
                "Tech_Skill": "Python",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Python, Scikit-learn, Decision Tree",
                "outcomeLearning": "Decision Trees are supervised learning models used for problems involving classification and regression. Tree models present a high flexibility that comes at a price: on one hand, trees are able to capture complex non-linear relationships; on the other hand, they are prone to memorizing the noise present in a dataset. By aggregating the predictions of trees that are trained differently, ensemble methods take advantage of the flexibility of trees while reducing their tendency to memorize noise. Ensemble methods are used across a variety of fields and have a proven track record of winning many machine learning competitions. In this course, you'll learn how to use Python to train Decision Trees and tree-based models with the user-friendly scikit-learn machine learning library. You'll understand the advantages and shortcomings of trees and demonstrate how ensembling can alleviate these shortcomings, all while practicing on real-world datasets. Finally, you'll also understand how to tune the most influential hyperparameters in order to get the most out of your models.",
                "provider": "Datacamp",
                "duration": "05:00:00",
                "feeVND": "0.0",
                "URL": "https://www.datacamp.com/courses/machine-learning-with-tree-based-models-in-python",
                "language": "English",
                "rating": "4.6",
                "peopleRating": "9794",
                "location": "",
                "level": "ALL Levels",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_141",
                "courseTitle": "Introduction to Google Colaboratory with Python",
                "Tech_Skill": "Python",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "Google Colaboratory, Jupyter, Python",
                "outcomeLearning": "Google Colaboratory is a Google cloud-based service that replicates Jupyter Notebook in the cloud. You don't have to install anything on your system to use it. In most respects, you use Colaboratory as you would a desktop installation of Jupyter Notebook. Google Colaboratory is primarily for those readers who use something other than a standard desktop setup to work.\nYou'll learn about the all features of Google Colaboratory.\nThe course is for you if you're a newcomer to Data Science and Python programming. Google recently update their Google Colabortatory in January 2020. This course is totally on the new version of Google Colaboratory",
                "provider": "Udemy",
                "duration": "00:30:00",
                "feeVND": "322078.0",
                "URL": "https://www.udemy.com/course/introduction-to-google-colaboratory-with-python/",
                "language": "English",
                "rating": "4.7",
                "peopleRating": "6",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            },
            {
                "courseID": "COURSE_201",
                "courseTitle": "MATLAB Programming for Engineers and Scientists Specialization",
                "Tech_Skill": "MatLab",
                "studyTime": "",
                "studyForm": "",
                "technologySkill": "OOP, MatLab",
                "outcomeLearning": "Computer programming in general and the MATLAB language in particular. Advanced MATLAB features such as the App Designer, Live Scripts and Object-Oriented Programming. Program efficiency and an introduction to algorithm complexity. Image processing, data visualization and an introduction to machine learning.",
                "provider": "Coursera",
                "duration": "06:00:00",
                "feeVND": "0.0",
                "URL": "https://www.coursera.org/specializations/matlab-programming-engineers-scientists",
                "language": "English, Arabic, French, Portuguese, Greek, Italian, Vietnamese, German, Russian, Spanish",
                "rating": "4.8",
                "peopleRating": "2923",
                "location": "",
                "level": "Beginner",
                "distance": "",
                "is_online": "true"
            }
        ],
        "Exception": [
            {
                "lstSkill_Provider": "NumPy, Python, R, SQL, SAS, Tableau, MongoDB, Amazon Web Services (AWS), MatLab",
                "lstSkill_notProvider": "Alteryx, Microsoft Outlook, Microsoft PowerPoint, Weka, Microsoft Word, Apache Accumulo, Apache Cassandra, Data Lake, Amazon DynamoDB, Apache Hbase, Apache Hadoop"
            },
            {
                "ExceptionType": "Fee",
                "Input": "5000000.0",
                "Output": "42914250.0",
                "Balance": "37914248.0"
            },
            {
                "ExceptionType": "Duration",
                "Input": "3 days, 0:00:00",
                "Output": "65 days, 11:30:00",
                "Balance": "62 days, 11:30:00"
            }
        ],
        "Ngoai_Le": {
            "Course_Offer": [],
            "ExceptionDetail": []
        }
    },
    "courses_offline": {
        "status": 201,
        "message": "frameRemain_Fulltime",
        "Course": [
            {
                "courseID": "COURSE_268",
                "courseTitle": "[HN] Python/Machine Learning",
                "Tech_Skill": "NumPy, Python",
                "studyTime": "18:00-21:00 (3 - 5)|08:30-11:30 (7)",
                "studyForm": "Part time",
                "technologySkill": "Python, NumPy, Pandas, Matplotlib, ScikitLearn, Git, Visual Studio Code, PyCharm, Jupyter, Google Colab",
                "outcomeLearning": "Provides you with the most commonly used knowledge and skills and is especially useful for any Machine Learning programmer. Upon completion of this course, you will have the following knowledge and skills: Specific core knowledge of the Python programming language; The data structures provided by Python and the methods available for each of the different data structures: String, List, Dictionary, Tuple, Set.; Compile, debug and execute the program on an IDE (Visual Studio Code, Pycharm...). Install and use Python libraries: Numpy, Pandas, Matplotlib, Scikit-learn. Provides knowledge about common problem types in machine learning, popular machine learning algorithms, and ways to evaluate model performance. A series of Lab exercises associated with the lessons help learners practice and practice skills and apply the knowledge they have learned. The completed student is able to: Be skilled in handling various types of data collected from various sources and aggregated in a form usable for machine learning. Have the skills to observe, analyze and visualize data to help make effective decisions. Understand and effectively apply various machine learning algorithms and technologies to other types of labeled and unlabeled data in practice. Good knowledge of common problem types in machine learning. Understand some of the parameters related to each machine learning algorithm and know how to customize it to improve the performance of the model. Applying and implementing important algorithms of supervised learning (Supervised Learning) and unsupervised learning (Unsupervised learning). Applying and implementing important algorithms belonging to the Recommendation System group. Understanding of precision metrics such as mean square error, confusion matrix, F1 score, R-squared, precision calculation methods and applying appropriate accuracy metrics for each machine learning problem.",
                "provider": "FPT Software Acedemy",
                "duration": "2 months",
                "feeVND": "13900000.0",
                "URL": "https://fsoft-academy.edu.vn/vi/khoa-hoc/hn-pythonmachine-learning-28",
                "language": "Vietnamese, Japanese",
                "rating": "",
                "peopleRating": "",
                "location": "Tòa nhà FPT, 17 Duy Tân, Quận Cầu Giấy, Hà Nội",
                "level": "Beginner",
                "distance": "4.563771543841572",
                "is_online": "false"
            }
        ],
        "Exception": [
            {
                "ExceptionType": "Frame_Remain",
                "frame_remain": "18:00-21:00 (3 - 5)|08:30-11:30 (7)"
            },
            {
                "ExceptionType": "Fee",
                "Input": "5000000.0",
                "Output": "13900000.0",
                "Balance": "8900000.0"
            },
            {
                "ExceptionType": "Duration",
                "Input": "3 days, 0:00:00",
                "Output": "60 days, 0:00:00",
                "Balance": "57 days, 0:00:00"
            },
            {
                "lstSkill_Provider_ngoaile": "NumPy, Python",
                "lstSkill_notProvider_ngoaile": "Alteryx, Microsoft Outlook, Microsoft PowerPoint, Weka, Microsoft Word, Apache Accumulo, Apache Cassandra, Data Lake, Amazon DynamoDB, Apache Hbase, Apache Hadoop"
            }
        ],
        "Ngoai_Le": {
            "Course_Offer": [],
            "ExceptionDetail": []
        }
    }
}