{
    "courses_offline": {
        "status": 201, 
        "Course": [
            {
                "Tech_Skill": "CSS, HTML", 
                "rating": "", 
                "peopleRating": "", 
                "language": "Vietnamese", 
                "feeVND": "13900000.0", 
                "level": "Beginner", 
                "courseID": "COURSE_276", 
                "URL": "https://fsoft-academy.edu.vn/vi/khoa-hoc/hn-it-fundamentals-41", 
                "studyForm": "Part time", 
                "studyTime": "18:00-21:00 (2 - 4 - 6)", 
                "technologySkill": "MS Windows 10, C, HTML, CSS, JavaScript, Visual Studio Code", 
                "courseTitle": "[HN] IT Fundamentals", 
                "location": "Tòa nhà FPT, 17 Duy Tân, Quận Cầu Giấy, Hà Nội", 
                "provider": "FPT Software Acedemy", 
                "duration": "2 months", 
                "outcomeLearning": "", 
                "is_online": "false", 
                "distance": "4.56377154384"
            }
        ], 
        "message": "frameRemain_Fulltime", 
        "Exception": [
            {
                "frame_remain": "18:00-21:00 (2 - 4 - 6)", 
                "ExceptionType": "Frame_Remain"
            }, 
            {
                "Input": "5000000.0", 
                "Balance": "8900000.0", 
                "ExceptionType": "Fee", 
                "Output": "13900000.0"
            }, 
            {
                "Input": "9 days, 0:00:00", 
                "Balance": "51 days, 0:00:00", 
                "ExceptionType": "Duration", 
                "Output": "60 days, 0:00:00"
            }, 
            {
                "lstSkill_notProvider_ngoaile": "SSIS, TFS, SSRS, SiteCore, UML, Kanban, SVN, EJB, SSMS, SharePoint, Sitefinity, WCF, T-SQL, Microsoft Visual Studio, Entity Framework, Umbraco, Kentico Kontent", 
                "lstSkill_Provider_ngoaile": "HTML, CSS"
            }
        ], 
        "Ngoai_Le": {
            "Course_Offer": [], 
            "ExceptionDetail": []
        }
    }, 
    "courses_online": {
        "status": 200, 
        "Course": [
            {
                "Tech_Skill": "Agile, Git, PostgreSQL, SOLID, SQL, Scrum", 
                "rating": "4.6", 
                "peopleRating": "9794", 
                "language": "English", 
                "feeVND": "0.0", 
                "level": "Beginner", 
                "courseID": "COURSE_032", 
                "URL": "https://www.codecademy.com/learn/paths/back-end-engineer-career-path", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "Kubernetes, PostgreSQL, JavaScript, Scrum, OOP, SQL, Oauth, Node.js, HTTP, Express.js, GitHub, Git, Agile, YAGNI, Docker, KISS, Azure DevOps, API, TDD, Design Patterns, RDBMS, DRY, SOLID, Linear Data Structures, Complex Data Structures, Search Algorithm", 
                "courseTitle": "Back-End Engineer1", 
                "location": "", 
                "provider": "Codecademy", 
                "duration": "2 months", 
                "outcomeLearning": "Setting Up Your Dev Environment. Learn about the field of web development and the tools developers use to create websites. JavaScript Syntax, Part I. Get introduced to JavaScript and get comfortable with the basics of writing JavaScript programs. JavaScript Syntax, Part II. Discover more JavaScript techniques and features including arrays, looping, and objects. Git and Github, Part I. Learn how to use the Git version control system to keep track of changes and document your work. Then learn markdown and publish your first. JavaScript Syntax Portfolio Project. Build a Node.js console app that generates random messages each time a user runs the program and version your project with Git/GitHub. Basics of Back-End Development. Start learning about back-end development and programming servers. JavaScript Syntax, Part III. Understand intermediate JavaScript concepts, such as classes, modules, and error handling. Fundamentals of Operating Systems. Learn about how Operating Systems work. Build a Back-End with Node/Express.js. Learn about the popular back-end environment, Node.js and how to create back-end servers and APIs in JavaScript using the popular Express.js. Test Driven Development with JavaScript. Understand the fundamentals of Test Driven Development (TDD) and how you can apply its principles when developing back-ends. Website Development Fundamentals. Be introduced to the field of front-end web development and create your first web page on the internet. Building Interactive Websites with JavaScript. Understand how JavaScript is used to add interactive experiences to a website. Async JavaScript and HTTP Requests. Learn about APIs (Application Programming Interfaces). Working with APIs will enable you to work with data stored on remote servers. Git and GitHub, Part II. Learn how to use Git and GitHub to collaborate efficiently with developers. Node/Express API Portfolio Project. You can use Node and Express to build an API that allows users to create and manage a personal budget. SQL for Back-End Development. Learn how to create tables, create, retrieve, and update data in SQL databases, and build a data-intensive web app. PostgreSQL Database. Much of the internet is the flow of information. Learn how databases store data so that it can be displayed on the web using PostgreSQL. Designing Relational Databases. Learn how to design relational databases that you can then implement in PostgreSQL advanced PostgreSQL. Learn about database performance and techniques for efficiently accessing data and maintaining optimal performance. Connecting Your Database to a Server\nLearn how to integrate a PostgreSQL database into your application. Deploying Your Server. Learn how to build an API with Node, Express, PostgreSQL and deploy it to Heroku. YAGNI, KISS, and DRY. Learn about different software principles. Object-Oriented Design & SOLID. Learn about object-oriented programming (OOP) and the principles of encapsulation, abstraction, inheritance, polymorphism as well as SOLID. Common Design Patterns. The goal of this unit is to introduce the concept of software design patterns. Software Architectural Patterns. Learn about the concept of architectural patterns as well as learn about specific patterns currently used by the development community. Relational Database and Software Architecture Portfolio Project\nTake your budget app one step further and add a new layer to the project by setting up a database. Security Basics. The goal of this unit is to introduce the basic concepts of web security including common threats, best practices and available technologies. Web Security. Learn intermediate concepts in web security and look at prevention techniques for common threats. Securing Your Server. Identify techniques you can use to secure your applications. Protecting Resources with OAuth. Learn how to protect your resources with authorization and authentication techniques. Database Security. Secure your databases from SQL injections and with security measures specifically for PostgreSQL. Introduction to Enterprise Development. Get an overview of the technologies involved in enterprise development. Caching & CDNs. Learn about how content is stored on different servers with caching and CDNs. Scaling Your Server. Learn different strategies for scaling your server. Alternative Technology Approaches. Get an introduction to several technologies that can expand your understanding of back-end architecture. Agile Methodologies. Learn about Agile methodologies and Scrum. Intro to DevOps Strategies. Learn about Continuous Integration and Continuous Delivery and how to implement them with GitHub Actions. Containerization with Docker. Learn about containerization technology and how to use services like Docker and Kubernetes. Security and Enterprise Portfolio Project. Build an API with Node, Express, and Postgres that uses authentication and authorization best practices to manage an online contest. Linear Data Structures. Begin interview preparation by learning the fundamentals of linear data structures. Complex Data Structures. Continue interview preparation by learning advanced applications of data structures.Algorithms. Continue interview preparation by learning the fundamentals of algorithms. Search & Graph Search Algorithms. Continue interview preparation by learning the fundamentals of search algorithms. Interview Skills. Review some key technical interview topics as well as soft skills which employers are looking for in potential candidates. Final Back-End Portfolio Project. Use everything you've learned in the path to build an API of your choosing.", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "Bootstrap, CSS, CSS3, HTML, HTML5", 
                "rating": "4.6", 
                "peopleRating": "9794", 
                "language": "English", 
                "feeVND": "0.0", 
                "level": "Beginner", 
                "courseID": "COURSE_062", 
                "URL": "https://www.codecademy.com/learn/make-a-website", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "CSS, HTML, HTML5, CSS3, Bootstrap", 
                "courseTitle": "How to Make a Website with NameCheap", 
                "location": "", 
                "provider": "Codecademy", 
                "duration": "09:00:00", 
                "outcomeLearning": "Build structure with HTML by adding text, links, images and more. Learn how to style text and add background images with CSS. Learn how CSS can manage boundaries and space on webpages. Learn to create a webpage quickly using the Twitter Bootstrap library. Learn how to create a personal portfolio and host it on your own domain!", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "HTMLCSS", 
                "rating": "4.6", 
                "peopleRating": "9794", 
                "language": "English", 
                "feeVND": "0.0", 
                "level": "Beginner", 
                "courseID": "COURSE_034", 
                "URL": "https://www.codecademy.com/learn/paths/full-stack-engineer-career-path", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "JavaScript, PostgreSQL, SQL, API, Node.js, JavaScript, GitHub, Git, TDD, Redux, Express.js, React, CSS, Graph Database, RESTful API, HTML, APIs, Linear Data Structures, Search Algorithm, Neo4J", 
                "courseTitle": "Full-Stack Software Engineer", 
                "location": "", 
                "provider": "Codecademy", 
                "duration": "01:52:00", 
                "outcomeLearning": "Welcome to the Full-Stack engineer path. Getting Started with Full-Stack Engineering. Introduction to software engineering. Setting Up Your Dev Environment. Learn about the field of web development and the tools developers use to create websites. JavaScript Syntax, Part I. Get introduced to JavaScript and get comfortable with the basics of writing JavaScript programs. JavaScript Syntax, Part II. Discover more JavaScript techniques and features including arrays, looping, and objects. Git and Github, Part I. Learn how to use the Git version control system to keep track of changes and document your work. Then learn markdown and publish your first. JavaScript Syntax Portfolio Project. Build a Node.js console app that generates random messages each time a user runs the program and version your project with Git/GitHub. Web Development Fundamentals. Be introduced to the field of front-end web development and create your first web page on the internet. Bringing Your Site Online. Learn about different methods for hosting your site, like GitHub pages and how to use a custom domain name. Improved Styling with CSS. Dig deeper into CSS and improve your ability to layout and style websites. Building Interactive Websites with JavaScript. Understand how JavaScript is used to add interactive experiences to a website. Making a Website Responsive. Learn how to create websites that can be viewed on a variety of devices and use different layouts and positioning. Making a Website Accessible. Refactor your website to follow the best accessibility (a11y) practices. HTML, CSS, and JS Portfolio Project. Bring together what you have learned in the previous lessons and build a project off of Codecademy. JavaScript Syntax, Part III. Understand intermediate JavaScript concepts, such as classes, modules, and error handling. Test Driven Development with JavaScript. Be introduced to the fundamentals of Test Driven Development (TDD). Async JavaScript and HTTP Requests. Learn about APIs (Application Programming Interfaces). Working with APIs will enable you to work with data stored on remote servers. Web Apps. Be introduced to web applications and learn about single page applications (SPAs) and how they are different from static websites. React, Part I. Be introduced to the popular JavaScript library, React. React, Part II. Dive further into React and learn about props, state, hooks as well as testing with Jest and Enzyme. Learn Redux, the library most commonly used with React to manage application state. Git and GitHub, Part II. Learn how to use Git and GitHub to collaborate efficiently with developers. React and Redux Portfolio Project. Bring together what you have learned in the previous lessons and build a project off of Codecademy. Basics of Back-End Development. Start learning about back-end development and programming servers. Build a Back-End with Node/Express.js. Learn about the popular back-end environment, Node.js and how to create back-end servers and APIs in JavaScript using the popular Express.js. Back-End and Feature Testing. Learn about TDD techniques for full-stack web applications. SQL for Back-End Development. Learn how to create tables, create, retrieve, and update data in SQL databases, and build a data-intensive web app. PostgreSQL Database. Much of the internet is the flow of information. Learn how databases store data so that it can be displayed on the web using PostgreSQL. Designing Relational Databases. Learn how to design relational databases that you can then implement in PostgreSQL. advanced PostgreSQL. Learn about database performance and techniques for efficiently accessing data and maintaining optimal performance. Back-End Portfolio Project. Build an e-commerce REST API using Node/Express and PostgreSQL. Connecting Front-End to Back-End. Learn about the different ways to combine your front-end and back-end systems to create a cohesive full-stack application. Adding a PostgreSQL Database. Learn PostgreSQL to connect JS and SQL in web apps, and build your first fully-integrated app back-end. Security, Authentication, and Authorization. Learn how to make a web application secure. Advanced Concepts in TDD. Learn advanced Test Driven Development (TDD) concepts that will help to test your web application as a whole. Full-Stack Portfolio Project. Expand the e-commerce REST API with a React client app, creating a PERN (Postgres, Express, React, Node) full-stack e-commerce experience. Linear Data Structures. Begin interview preparation by learning the fundamentals of linear data structures. Complex Data Structures. Continue interview preparation by learning advanced applications of data structures. Continue interview preparation by learning the fundamentals of algorithms. Search & Graph Search Algorithms. Continue interview preparation by learning the fundamentals of search algorithms. Interview Skills. Review some key technical interview topics as well as soft skills which employers are looking for in potential candidates. Final Portfolio Project. Build a PERN app of your choosing and deploy it to Heroku.", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "C#, LinQ", 
                "rating": "4.6", 
                "peopleRating": "9794", 
                "language": "English", 
                "feeVND": "0.0", 
                "level": "Beginner", 
                "courseID": "COURSE_022", 
                "URL": "https://www.codecademy.com/learn/learn-c-sharp", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "LinQ, C#, OOP", 
                "courseTitle": "Learn C#", 
                "location": "", 
                "provider": "Codecademy", 
                "duration": "06:00:00", 
                "outcomeLearning": "Learn about C#, a programming language used for websites, apps, video games, and virtual reality. Learn about how types and variables are used in C#. Learn how to work with Boolean logic and conditional statements in C#. Learn to call and create methods: a fundamental building block in C# development. Learn how to organize data and automate repetitive tasks with arrays and loops. Define your own custom types using classes. Organize, secure, and simplify your code with interfaces and inheritance. Unlock the power of references: an essential aspect of object-oriented programming in C#. Work with data in C# using lists and LINQ queries", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "CI/CD", 
                "rating": "4.6", 
                "peopleRating": "108", 
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish", 
                "feeVND": "0.0", 
                "level": "Beginner", 
                "courseID": "COURSE_189", 
                "URL": "https://www.coursera.org/specializations/ibm-cloud-application-development-foundations", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "Node.js, Cloud Native, React, GitHub, CSS, NoSQL, HTML, JavaScript, SQL, CI/CD, Azure DevOps, Cloud Computing, Hybrid Multicloud, IaaS, PAAS, SAAS", 
                "courseTitle": "Cloud Application Development Foundations Specialization", 
                "location": "", 
                "provider": "Coursera", 
                "duration": "12:00:00", 
                "outcomeLearning": "Define cloud computing and explain its essential characteristics, models, benefits, infrastructure, & emerging trends. Create a cloud account. Develop with front-end development languages and tools such as HTML, CSS, Javascript and React. Program applications with back-end development languages and tools such as Node.js  and NoSQL databases. Build and deploy applications using Cloud Native methodologies and tools, CI/CD toolchains, and build your portfolio using GitHub", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "CI/CD", 
                "rating": "5.0", 
                "peopleRating": "8", 
                "language": "English", 
                "feeVND": "322078.0", 
                "level": "ALL Levels", 
                "courseID": "COURSE_145", 
                "URL": "https://www.udemy.com/course/mobile-device-farm-stf-python-jenkins-selenium/", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "RAS, STF, Jenkins, Python RPC, OpenSTF, AWS Device Farm, Selenium GRID, Appium, Python, API, RESTful API, APIs, CI/CD", 
                "courseTitle": "Build Mobile Testing Device Farm / Device Lab From Scratch\n", 
                "location": "", 
                "provider": "Udemy", 
                "duration": "05:25:00", 
                "outcomeLearning": "Basic understanding of Device Farm / Device Lab concepts and various types.\nOpenSTF / Device Farmer details, install/deploy, admin activity, user groups, device distribution, Device Remote Access, REST APIs of STF.\nOpenSTF / Device Farmer integration with Python RPC server (STF Service monitoring, API Gateway, Reserve Device, Release Device, Appium integration etc).\nJenkins Embedded Device Farm (unique concept to develop Jenkins infrastructure with real devices for CI/CD), Selenium GRID & Appium", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "JQuery", 
                "rating": "4.6", 
                "peopleRating": "3461", 
                "language": "English, Arabic, French, Portuguese, Chinese, Italian, Vietnamese, German, Russian, Spanish", 
                "feeVND": "0.0", 
                "level": "Beginner", 
                "courseID": "COURSE_120", 
                "URL": "https://www.coursera.org/specializations/website-development", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "CSS, Web Design, MongoDB, API, HTML, UX, JavaScript, Meteor, APIs, JQuery, CSS3, Reactive Power", 
                "courseTitle": "Responsive Website Development and Design Specialization", 
                "location": "", 
                "provider": "Coursera", 
                "duration": "11:00:00", 
                "outcomeLearning": "Responsive web design is all about creating the best user experience regardless of whether a user is accessing your site from a desktop computer, a mobile phone, or a tablet. This Specialisation covers the basics of modern full stack web development, from UX design to front-end coding to custom databases. You'll build foundational skills in a full range of technologies, including HTML/CSS, Javascript, and MongoDB, and you'll learn to implement a reactive, multi-user web application using the meteor.js framework. We'll also touch on more advanced topics, such as APIs, data visualization, and animation. You will add several projects to your portfolio to demonstrate your skill and growth throughout this Specialisation. You will create web pages using basic elements to control layout and style, use responsive web design principles to take a site from wireframe to website, implement security features, and create collaborative multi-user experiences. Just like any professional full stack web developer, you will build accessibility and usability into your responsive websites.", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "Amazon Web Services (AWS)", 
                "rating": "4.7", 
                "peopleRating": "4832", 
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish", 
                "feeVND": "414166.0", 
                "level": "Beginner", 
                "courseID": "COURSE_177", 
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "Microsoft Excel, Matplotlib, NumPy, SQL, Cognos, Amazon Web Services (AWS), Python, API, Pandas, Jupyter, Data Visualization, Pivot Table, Dashboard, Pandas, APIs", 
                "courseTitle": "IBM Data Analyst Professional Certificate", 
                "location": "", 
                "provider": "Coursera", 
                "duration": "09:00:00", 
                "outcomeLearning": "Demonstrate proficiency in using spreadsheets and utilizing Excel to perform a variety of data analysis tasks like data wrangling and data mining. Create various charts and plots in Excel & work with IBM Cognos Analytics to build dashboards. Visualize data using Python libraries like Matplotlib. Develop working knowledge of Python language for analyzing data using Python libraries like Pandas and Numpy, and invoke APIs and Web Services. Describe data ecosystem and Compose queries to access data in cloud databases using SQL and Python from Jupyter Notebooks", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "Amazon Web Services (AWS)", 
                "rating": "4.7", 
                "peopleRating": "4832", 
                "language": "English, Arabic, French, Portuguese, Italian, Vietnamese, German, Russian, Spanish", 
                "feeVND": "0.0", 
                "level": "Beginner", 
                "courseID": "COURSE_223", 
                "URL": "https://www.coursera.org/professional-certificates/ibm-data-analyst", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "Microsoft Excel, Matplotlib, NumPy, SQL, Cognos, Amazon Web Services (AWS), Python, API, Pandas, Jupyter, Data Visualization, Pivot Table, Dashboard, Pandas, APIs", 
                "courseTitle": "IBM Data Analyst Professional Certificate 1", 
                "location": "", 
                "provider": "Udemy", 
                "duration": "09:00:00", 
                "outcomeLearning": "Demonstrate proficiency in using spreadsheets and utilizing Excel to perform a variety of data analysis tasks like data wrangling and data mining. Create various charts and plots in Excel & work with IBM Cognos Analytics to build dashboards. Visualize data using Python libraries like Matplotlib. Develop working knowledge of Python language for analyzing data using Python libraries like Pandas and Numpy, and invoke APIs and Web Services. Describe data ecosystem and Compose queries to access data in cloud databases using SQL and Python from Jupyter Notebooks", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "Angular", 
                "rating": "4.6", 
                "peopleRating": "144243", 
                "language": "English, French, German, Indonesian, Italian, Portuguese, Spanish", 
                "feeVND": "322078.0", 
                "level": "ALL Levels", 
                "courseID": "COURSE_092", 
                "URL": "https://bit.ly/3fayWdT", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "Angular, HTML, CSS, TypeScript, JavaScript", 
                "courseTitle": "Angular - The Complete Guide (2021 Edition)", 
                "location": "", 
                "provider": "Udemy", 
                "duration": "10:07:00", 
                "outcomeLearning": "Develop modern, complex, responsive and scalable web applications with Angular 12. Use the gained, deep understanding of the Angular fundamentals to quickly establish yourself as a frontend developer. Fully understand the architecture behind an Angular application and how to use it. Create single-page applications with one of the most modern JavaScript frameworks out there.", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "BI", 
                "rating": "4.4", 
                "peopleRating": "1084", 
                "language": "English", 
                "feeVND": "322078.0", 
                "level": "ALL Levels", 
                "courseID": "COURSE_147", 
                "URL": "https://www.udemy.com/course/sap-analytics-cloud-sac/", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "BI, SAP, SAP Analytics Cloud, Big Data, SAC", 
                "courseTitle": "The Complete SAP Analytics Cloud Course 2021", 
                "location": "", 
                "provider": "Udemy", 
                "duration": "03:09:00", 
                "outcomeLearning": "Create your own story to build not only pleasing but informative data visualizations.\nDevelop and execute the planning and budgeting using SAP Analytics Cloud.\nBuild big data predictive models using machine learning technologies embedded in SAP Analytics Cloud.\nMaster advanced tips to help you get the most out of the SAC, including BI, planning, smart predicts, and more.\nLearn key concepts within SAP Analytics Cloud and valuable tips to help you use this app most effectively.\nMost everything you need or want to know to deploy and use SAP Analytics Cloud.\nYou'll use the skills you've developed to better understand and pass the SAC certificate exam in confidence.\nUnderstand SAP analytics cloud offerings and the level of subscription that each entail.", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "Microsoft SQL Server", 
                "rating": "4.6", 
                "peopleRating": "9794", 
                "language": "English", 
                "feeVND": "0.0", 
                "level": "Beginner", 
                "courseID": "COURSE_150", 
                "URL": "https://www.datacamp.com/courses/introduction-to-sql", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "Microsoft SQL Server, MySQL, PostgreSQL, SQL, Microsoft Oracle", 
                "courseTitle": "Introduction to SQL", 
                "location": "", 
                "provider": "Datacamp", 
                "duration": "04:00:00", 
                "outcomeLearning": "The role of a data scientist is to turn raw data into actionable insights. Much of the world's raw data—from electronic medical records to customer transaction histories—lives in organized collections of tables called relational databases. To be an effective data scientist, you must know how to wrangle and extract data from these databases using a language called SQL . This course teaches syntax in SQL shared by many types of databases, such as PostgreSQL, MySQL, SQL Server, and Oracle. This course teaches you everything you need to know to begin working with databases today!", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "SQL", 
                "rating": "4.4", 
                "peopleRating": "146", 
                "language": "English", 
                "feeVND": "0.0", 
                "level": "Beginner", 
                "courseID": "COURSE_172", 
                "URL": "https://www.coursera.org/projects/dynamic-web-app-php-mysql", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "PHP, MySQL, SQL", 
                "courseTitle": "Building a Dynamic Web App using PHP & MySQL", 
                "location": "", 
                "provider": "Coursera", 
                "duration": "02:00:00", 
                "outcomeLearning": "In this 1-hour long project-based course, you will learn how to create a simple note-taking web app using PHP and MySQL. PHP and MySQL enable developing powerful dynamic web pages and applications. They are some of the most widely used technologies in the world right now for developing back-end applications. They allow you to create dynamic content on your webpage and bring it to life. They also allow to persist data in the backend database and use them in every different way. Eventually, you will be able to use the concepts you learned to build more complex and powerful web pages and applications using PHP and MySQL. This will open huge career opportunities in the field of back end web and mobile development.", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "Vue.js", 
                "rating": "4.6", 
                "peopleRating": "9794", 
                "language": "English", 
                "feeVND": "0.0", 
                "level": "Beginner", 
                "courseID": "COURSE_041", 
                "URL": "https://www.codecademy.com/learn/learn-vue-js", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "Vue.js, JavaScript", 
                "courseTitle": "Learn Vue.js", 
                "location": "", 
                "provider": "Codecademy", 
                "duration": "03:00:00", 
                "outcomeLearning": "Learn how to make front-end web apps with ease using Vue.js, an increasingly popular JavaScript front-end framework. Learn how to make front-end web apps with ease using Vue.js, an increasingly popular JavaScript front-end framework. Learn how to make front-end web apps with ease using Vue.js, an increasingly popular JavaScript front-end framework. Learn how to make front-end web apps with ease using Vue.js, an increasingly popular JavaScript front-end framework", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "BI", 
                "rating": "4.6", 
                "peopleRating": "9794", 
                "language": "English", 
                "feeVND": "0.0", 
                "level": "ALL Levels", 
                "courseID": "COURSE_153", 
                "URL": "https://www.datacamp.com/courses/introduction-to-tableau", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "BI, Tableau", 
                "courseTitle": "Introduction to Tableau", 
                "location": "", 
                "provider": "Datacamp", 
                "duration": "06:00:00", 
                "outcomeLearning": "Tableau is a widely used business intelligence (BI) and analytics software trusted by companies like Amazon, Experian, and Unilever to explore, visualize, and securely share data in the form of Workbooks and Dashboards. With its user-friendly drag-and-drop functionality it can be used by everyone to quickly clean, analyze, and visualize your team's data. You'll learn how to navigate Tableau's interface and connect and present data using easy-to-understand visualizations. By the end of this training, you'll have the skills you need to confidently explore Tableau and build impactful data dashboards. Let's dive in.", 
                "is_online": "true", 
                "distance": ""
            }, 
            {
                "Tech_Skill": "BI", 
                "rating": "4.6", 
                "peopleRating": "9794", 
                "language": "English", 
                "feeVND": "0.0", 
                "level": "ALL Levels", 
                "courseID": "COURSE_156", 
                "URL": "https://www.datacamp.com/courses/introduction-to-power-bi", 
                "studyForm": "", 
                "studyTime": "", 
                "technologySkill": "Microsoft Power BI, BI", 
                "courseTitle": "Introduction to Power BI", 
                "location": "", 
                "provider": "Datacamp", 
                "duration": "06:00:00", 
                "outcomeLearning": "Gain a 360° overview of how to explore and use Power BI to build impactful reports. In this course, you'll go from zero to hero, as you discover how to use this popular business intelligence platform through hands-on exercises. You'll first learn how to confidently load and transform data using Power Query and the importance of data models, before diving into creating visualizations using Power BI's drag-and-drop functionality. You'll also learn how to drill-down into reports and make your reports fully interactive. Lastly, you'll level-up your skills using DAX (Data Analysis Expressions) formulas to create customized calculated columns and fields to better analyze your data. Get started now. You've got the power!", 
                "is_online": "true", 
                "distance": ""
            }
        ], 
        "message": "PASS", 
        "Exception": [
            {
                "lstSkill_notProvider": "SSIS, TFS, SSRS, SiteCore, UML, Kanban, SVN, EJB, SSMS, SharePoint, Sitefinity, WCF, T-SQL, Microsoft Visual Studio, Entity Framework, Umbraco, Kentico Kontent", 
                "lstSkill_Provider": "CSS3, JQuery, Git, PostgreSQL, SOLID, Agile, Microsoft SQL Server, Scrum, BI, LinQ, CI/CD, Vue.js, C#, HTML, CSS, SQL, Amazon Web Services (AWS), Angular, Bootstrap, HTML5"
            }, 
            {
                "Input": "9 days, 0:00:00", 
                "Balance": "58 days, 23:41:00", 
                "ExceptionType": "Duration", 
                "Output": "67 days, 23:41:00"
            }
        ], 
        "Ngoai_Le": {
            "Course_Offer": [], 
            "ExceptionDetail": []
        }
    }
}